espressif/esp-idf/components/soc/esp32h4/register/soc/pcr_reg.h
/** PCR_I2S_RX_CLKM_DIV_CONF_REG register
 *  I2S_RX_CLKM_DIV configuration register
 */
#define PCR_I2S_RX_CLKM_DIV_CONF_REG (DR_REG_PCR_BASE + 0x80)
/** PCR_I2S_RX_CLKM_DIV_Z : R/W; bitpos: [8:0]; default: 0;
 *  For b <= a/2, the value of I2S_RX_CLKM_DIV_Z is b. For b > a/2, the value of
 *  I2S_RX_CLKM_DIV_Z is (a-b).
 */
#define PCR_I2S_RX_CLKM_DIV_Z    0x000001FFU
#define PCR_I2S_RX_CLKM_DIV_Z_M  (PCR_I2S_RX_CLKM_DIV_Z_V << PCR_I2S_RX_CLKM_DIV_Z_S)
#define PCR_I2S_RX_CLKM_DIV_Z_V  0x000001FFU
#define PCR_I2S_RX_CLKM_DIV_Z_S  0
/** PCR_I2S_RX_CLKM_DIV_Y : R/W; bitpos: [17:9]; default: 1;
 *  For b <= a/2, the value of I2S_RX_CLKM_DIV_Y is (a%b) . For b > a/2, the value of
 *  I2S_RX_CLKM_DIV_Y is (a%(a-b)).
 */
#define PCR_I2S_RX_CLKM_DIV_Y    0x000001FFU
#define PCR_I2S_RX_CLKM_DIV_Y_M  (PCR_I2S_RX_CLKM_DIV_Y_V << PCR_I2S_RX_CLKM_DIV_Y_S)
#define PCR_I2S_RX_CLKM_DIV_Y_V  0x000001FFU
#define PCR_I2S_RX_CLKM_DIV_Y_S  9
/** PCR_I2S_RX_CLKM_DIV_X : R/W; bitpos: [26:18]; default: 0;
 *  For b <= a/2, the value of I2S_RX_CLKM_DIV_X is (a/b) - 1. For b > a/2, the value
 *  of I2S_RX_CLKM_DIV_X is (a/(a-b)) - 1.
 */
#define PCR_I2S_RX_CLKM_DIV_X    0x000001FFU
#define PCR_I2S_RX_CLKM_DIV_X_M  (PCR_I2S_RX_CLKM_DIV_X_V << PCR_I2S_RX_CLKM_DIV_X_S)
#define PCR_I2S_RX_CLKM_DIV_X_V  0x000001FFU
#define PCR_I2S_RX_CLKM_DIV_X_S  18
/** PCR_I2S_RX_CLKM_DIV_YN1 : R/W; bitpos: [27]; default: 0;
 *  For b <= a/2, the value of I2S_RX_CLKM_DIV_YN1 is 0 . For b > a/2, the value of
 *  I2S_RX_CLKM_DIV_YN1 is 1.
 */
#define PCR_I2S_RX_CLKM_DIV_YN1    (BIT(27))
#define PCR_I2S_RX_CLKM_DIV_YN1_M  (PCR_I2S_RX_CLKM_DIV_YN1_V << PCR_I2S_RX_CLKM_DIV_YN1_S)
#define PCR_I2S_RX_CLKM_DIV_YN1_V  0x00000001U
#define PCR_I2S_RX_CLKM_DIV_YN1_S  27

/** PCR_SARADC_CONF_REG register
 *  SARADC configuration register
 */
#define PCR_SARADC_CONF_REG (DR_REG_PCR_BASE + 0x84)
/** PCR_SARADC_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  no use
 */
#define PCR_SARADC_CLK_EN    (BIT(0))
#define PCR_SARADC_CLK_EN_M  (PCR_SARADC_CLK_EN_V << PCR_SARADC_CLK_EN_S)
#define PCR_SARADC_CLK_EN_V  0x00000001U
#define PCR_SARADC_CLK_EN_S  0
/** PCR_SARADC_RST_EN : R/W; bitpos: [1]; default: 0;
 *  Set 1 to reset function_register of saradc module
 */
#define PCR_SARADC_RST_EN    (BIT(1))
#define PCR_SARADC_RST_EN_M  (PCR_SARADC_RST_EN_V << PCR_SARADC_RST_EN_S)
#define PCR_SARADC_RST_EN_V  0x00000001U
#define PCR_SARADC_RST_EN_S  1
/** PCR_SARADC_REG_CLK_EN : R/W; bitpos: [2]; default: 0;
 *  Set 1 to enable saradc apb clock
 */
#define PCR_SARADC_REG_CLK_EN    (BIT(2))
#define PCR_SARADC_REG_CLK_EN_M  (PCR_SARADC_REG_CLK_EN_V << PCR_SARADC_REG_CLK_EN_S)
#define PCR_SARADC_REG_CLK_EN_V  0x00000001U
#define PCR_SARADC_REG_CLK_EN_S  2
/** PCR_SARADC_REG_RST_EN : R/W; bitpos: [3]; default: 0;
 *  Set 1 to reset apb_register of saradc module
 */
#define PCR_SARADC_REG_RST_EN    (BIT(3))
#define PCR_SARADC_REG_RST_EN_M  (PCR_SARADC_REG_RST_EN_V << PCR_SARADC_REG_RST_EN_S)
#define PCR_SARADC_REG_RST_EN_V  0x00000001U
#define PCR_SARADC_REG_RST_EN_S  3

/** PCR_SARADC_CLKM_CONF_REG register
 *  SARADC_CLKM configuration register
 */
#define PCR_SARADC_CLKM_CONF_REG (DR_REG_PCR_BASE + 0x88)
/** PCR_SARADC_CLKM_DIV_A : R/W; bitpos: [5:0]; default: 0;
 *  The  denominator of the frequency divider factor of the saradc function clock.
 */
#define PCR_SARADC_CLKM_DIV_A    0x0000003FU
#define PCR_SARADC_CLKM_DIV_A_M  (PCR_SARADC_CLKM_DIV_A_V << PCR_SARADC_CLKM_DIV_A_S)
#define PCR_SARADC_CLKM_DIV_A_V  0x0000003FU
#define PCR_SARADC_CLKM_DIV_A_S  0
/** PCR_SARADC_CLKM_DIV_B : R/W; bitpos: [11:6]; default: 0;
 *  The numerator of the frequency divider factor of the saradc function clock.
 */
#define PCR_SARADC_CLKM_DIV_B    0x0000003FU
#define PCR_SARADC_CLKM_DIV_B_M  (PCR_SARADC_CLKM_DIV_B_V << PCR_SARADC_CLKM_DIV_B_S)
#define PCR_SARADC_CLKM_DIV_B_V  0x0000003FU
#define PCR_SARADC_CLKM_DIV_B_S  6
/** PCR_SARADC_CLKM_DIV_NUM : R/W; bitpos: [19:12]; default: 0;
 *  The integral part of the frequency divider factor of the saradc function clock.
 */
#define PCR_SARADC_CLKM_DIV_NUM    0x000000FFU
#define PCR_SARADC_CLKM_DIV_NUM_M  (PCR_SARADC_CLKM_DIV_NUM_V << PCR_SARADC_CLKM_DIV_NUM_S)
#define PCR_SARADC_CLKM_DIV_NUM_V  0x000000FFU
#define PCR_SARADC_CLKM_DIV_NUM_S  12
/** PCR_SARADC_CLKM_SEL : R/W; bitpos: [20]; default: 0;
 *  Configures the clock source of SAR ADC.
 *  0 (default): XTAL_CLK
 *  1: RC_FAST_CLK
 */
#define PCR_SARADC_CLKM_SEL    (BIT(20))
#define PCR_SARADC_CLKM_SEL_M  (PCR_SARADC_CLKM_SEL_V << PCR_SARADC_CLKM_SEL_S)
#define PCR_SARADC_CLKM_SEL_V  0x00000001U
#define PCR_SARADC_CLKM_SEL_S  20
/** PCR_SARADC_CLKM_EN : R/W; bitpos: [22]; default: 0;
 *  Set 1 to enable saradc function clock
 */
#define PCR_SARADC_CLKM_EN    (BIT(22))
#define PCR_SARADC_CLKM_EN_M  (PCR_SARADC_CLKM_EN_V << PCR_SARADC_CLKM_EN_S)
#define PCR_SARADC_CLKM_EN_V  0x00000001U
#define PCR_SARADC_CLKM_EN_S  22

/** PCR_TSENS_CLK_CONF_REG register
 *  TSENS_CLK configuration register
 */
#define PCR_TSENS_CLK_CONF_REG (DR_REG_PCR_BASE + 0x8c)
/** PCR_TSENS_CLK_SEL : R/W; bitpos: [20]; default: 0;
 *  Configures the clock source of the temperature sensor.
 *  0 (default): XTAL_CLK
 *  1: RC_FAST_CLK
 */
#define PCR_TSENS_CLK_SEL    (BIT(20))
#define PCR_TSENS_CLK_SEL_M  (PCR_TSENS_CLK_SEL_V << PCR_TSENS_CLK_SEL_S)
#define PCR_TSENS_CLK_SEL_V  0x00000001U
#define PCR_TSENS_CLK_SEL_S  20
/** PCR_TSENS_CLK_EN : R/W; bitpos: [22]; default: 0;
 *  Set 1 to enable tsens clock
 */
#define PCR_TSENS_CLK_EN    (BIT(22))
#define PCR_TSENS_CLK_EN_M  (PCR_TSENS_CLK_EN_V << PCR_TSENS_CLK_EN_S)
#define PCR_TSENS_CLK_EN_V  0x00000001U
#define PCR_TSENS_CLK_EN_S  22
/** PCR_TSENS_RST_EN : R/W; bitpos: [23]; default: 0;
 *  Set 1 to reset tsens module
 */
#define PCR_TSENS_RST_EN    (BIT(23))
#define PCR_TSENS_RST_EN_M  (PCR_TSENS_RST_EN_V << PCR_TSENS_RST_EN_S)
#define PCR_TSENS_RST_EN_V  0x00000001U
#define PCR_TSENS_RST_EN_S  23

/** PCR_USB_DEVICE_CONF_REG register
 *  USB_DEVICE configuration register
 */
#define PCR_USB_DEVICE_CONF_REG (DR_REG_PCR_BASE + 0x90)
/** PCR_USB_DEVICE_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  Set 1 to enable usb_device clock
 */
#define PCR_USB_DEVICE_CLK_EN    (BIT(0))
#define PCR_USB_DEVICE_CLK_EN_M  (PCR_USB_DEVICE_CLK_EN_V << PCR_USB_DEVICE_CLK_EN_S)
#define PCR_USB_DEVICE_CLK_EN_V  0x00000001U
#define PCR_USB_DEVICE_CLK_EN_S  0
/** PCR_USB_DEVICE_RST_EN : R/W; bitpos: [1]; default: 0;
 *  Set 1 to reset usb_device module
 */
#define PCR_USB_DEVICE_RST_EN    (BIT(1))
#define PCR_USB_DEVICE_RST_EN_M  (PCR_USB_DEVICE_RST_EN_V << PCR_USB_DEVICE_RST_EN_S)
#define PCR_USB_DEVICE_RST_EN_V  0x00000001U
#define PCR_USB_DEVICE_RST_EN_S  1
/** PCR_USB_DEVICE_READY : RO; bitpos: [2]; default: 1;
 *  Query this field after reset usb_device module
 */
#define PCR_USB_DEVICE_READY    (BIT(2))
#define PCR_USB_DEVICE_READY_M  (PCR_USB_DEVICE_READY_V << PCR_USB_DEVICE_READY_S)
#define PCR_USB_DEVICE_READY_V  0x00000001U
#define PCR_USB_DEVICE_READY_S  2

/** PCR_USB_DEVICE_MEM_LP_CTRL_REG register
 *  USB_DEVICE memory power control register
 */
#define PCR_USB_DEVICE_MEM_LP_CTRL_REG (DR_REG_PCR_BASE + 0x94)
/** PCR_USB_DEVICE_MEM_LP_MODE : R/W; bitpos: [1:0]; default: 0;
 *  Configures usb_device memory low power mode in low power stage.
 *  0(default): deep sleep
 *  1: light sleep
 *  2: shut down
 *  3: disable low power stage
 */
#define PCR_USB_DEVICE_MEM_LP_MODE    0x00000003U
#define PCR_USB_DEVICE_MEM_LP_MODE_M  (PCR_USB_DEVICE_MEM_LP_MODE_V << PCR_USB_DEVICE_MEM_LP_MODE_S)
#define PCR_USB_DEVICE_MEM_LP_MODE_V  0x00000003U
#define PCR_USB_DEVICE_MEM_LP_MODE_S  0
/** PCR_USB_DEVICE_MEM_LP_EN : R/W; bitpos: [2]; default: 0;
 *  Set this bit to power down usb_device memory.
 */
#define PCR_USB_DEVICE_MEM_LP_EN    (BIT(2))
#define PCR_USB_DEVICE_MEM_LP_EN_M  (PCR_USB_DEVICE_MEM_LP_EN_V << PCR_USB_DEVICE_MEM_LP_EN_S)
#define PCR_USB_DEVICE_MEM_LP_EN_V  0x00000001U
#define PCR_USB_DEVICE_MEM_LP_EN_S  2
/** PCR_USB_DEVICE_MEM_FORCE_CTRL : R/W; bitpos: [3]; default: 0;
 *  Set this bit to force software control usb_device memory, disable hardware control.
 */
#define PCR_USB_DEVICE_MEM_FORCE_CTRL    (BIT(3))
#define PCR_USB_DEVICE_MEM_FORCE_CTRL_M  (PCR_USB_DEVICE_MEM_FORCE_CTRL_V << PCR_USB_DEVICE_MEM_FORCE_CTRL_S)
#define PCR_USB_DEVICE_MEM_FORCE_CTRL_V  0x00000001U
#define PCR_USB_DEVICE_MEM_FORCE_CTRL_S  3

/** PCR_INTMTX_CONF_REG register
 *  INTMTX configuration register
 */
#define PCR_INTMTX_CONF_REG (DR_REG_PCR_BASE + 0x98)
/** PCR_INTMTX_CORE0_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  Set 1 to enable core0 intmtx clock
 */
#define PCR_INTMTX_CORE0_CLK_EN    (BIT(0))
#define PCR_INTMTX_CORE0_CLK_EN_M  (PCR_INTMTX_CORE0_CLK_EN_V << PCR_INTMTX_CORE0_CLK_EN_S)
#define PCR_INTMTX_CORE0_CLK_EN_V  0x00000001U
#define PCR_INTMTX_CORE0_CLK_EN_S  0
/** PCR_INTMTX_CORE0_RST_EN : R/W; bitpos: [1]; default: 0;
 *  Set 1 to reset core0 intmtx module
 */
#define PCR_INTMTX_CORE0_RST_EN    (BIT(1))
#define PCR_INTMTX_CORE0_RST_EN_M  (PCR_INTMTX_CORE0_RST_EN_V << PCR_INTMTX_CORE0_RST_EN_S)
#define PCR_INTMTX_CORE0_RST_EN_V  0x00000001U
#define PCR_INTMTX_CORE0_RST_EN_S  1
/** PCR_INTMTX_CORE1_CLK_EN : R/W; bitpos: [2]; default: 0;
 *  Set 1 to enable core1 intmtx clock
 */
#define PCR_INTMTX_CORE1_CLK_EN    (BIT(2))
#define PCR_INTMTX_CORE1_CLK_EN_M  (PCR_INTMTX_CORE1_CLK_EN_V << PCR_INTMTX_CORE1_CLK_EN_S)
#define PCR_INTMTX_CORE1_CLK_EN_V  0x00000001U
#define PCR_INTMTX_CORE1_CLK_EN_S  2
/** PCR_INTMTX_CORE1_RST_EN : R/W; bitpos: [3]; default: 1;
 *  Set 1 to reset core1 intmtx module
 */
#define PCR_INTMTX_CORE1_RST_EN    (BIT(3))
#define PCR_INTMTX_CORE1_RST_EN_M  (PCR_INTMTX_CORE1_RST_EN_V << PCR_INTMTX_CORE1_RST_EN_S)
#define PCR_INTMTX_CORE1_RST_EN_V  0x00000001U
#define PCR_INTMTX_CORE1_RST_EN_S  3
/** PCR_INTMTX_CORE0_READY : RO; bitpos: [4]; default: 1;
 *  Query this field after reset intmtx module
 */
#define PCR_INTMTX_CORE0_READY    (BIT(4))
#define PCR_INTMTX_CORE0_READY_M  (PCR_INTMTX_CORE0_READY_V << PCR_INTMTX_CORE0_READY_S)
#define PCR_INTMTX_CORE0_READY_V  0x00000001U
#define PCR_INTMTX_CORE0_READY_S  4
/** PCR_INTMTX_CORE1_READY : RO; bitpos: [5]; default: 1;
 *  Query this field after reset intmtx module
 */
#define PCR_INTMTX_CORE1_READY    (BIT(5))
#define PCR_INTMTX_CORE1_READY_M  (PCR_INTMTX_CORE1_READY_V << PCR_INTMTX_CORE1_READY_S)
#define PCR_INTMTX_CORE1_READY_V  0x00000001U
#define PCR_INTMTX_CORE1_READY_S  5

