espressif/esp-idf/components/soc/esp32h4/register/soc/pcr_reg.h
/** PCR_PCNT_CONF_REG register
 *  PCNT configuration register
 */
#define PCR_PCNT_CONF_REG (DR_REG_PCR_BASE + 0x9c)
/** PCR_PCNT_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  Set 1 to enable pcnt clock
 */
#define PCR_PCNT_CLK_EN    (BIT(0))
#define PCR_PCNT_CLK_EN_M  (PCR_PCNT_CLK_EN_V << PCR_PCNT_CLK_EN_S)
#define PCR_PCNT_CLK_EN_V  0x00000001U
#define PCR_PCNT_CLK_EN_S  0
/** PCR_PCNT_RST_EN : R/W; bitpos: [1]; default: 0;
 *  Set 1 to reset pcnt module
 */
#define PCR_PCNT_RST_EN    (BIT(1))
#define PCR_PCNT_RST_EN_M  (PCR_PCNT_RST_EN_V << PCR_PCNT_RST_EN_S)
#define PCR_PCNT_RST_EN_V  0x00000001U
#define PCR_PCNT_RST_EN_S  1
/** PCR_PCNT_REG_CLK_EN : R/W; bitpos: [2]; default: 0;
 *  Set 1 to enable pcnt reg clock
 */
#define PCR_PCNT_REG_CLK_EN    (BIT(2))
#define PCR_PCNT_REG_CLK_EN_M  (PCR_PCNT_REG_CLK_EN_V << PCR_PCNT_REG_CLK_EN_S)
#define PCR_PCNT_REG_CLK_EN_V  0x00000001U
#define PCR_PCNT_REG_CLK_EN_S  2
/** PCR_PCNT_REG_RST_EN : R/W; bitpos: [3]; default: 0;
 *  Set 1 to reset pcnt reg module
 */
#define PCR_PCNT_REG_RST_EN    (BIT(3))
#define PCR_PCNT_REG_RST_EN_M  (PCR_PCNT_REG_RST_EN_V << PCR_PCNT_REG_RST_EN_S)
#define PCR_PCNT_REG_RST_EN_V  0x00000001U
#define PCR_PCNT_REG_RST_EN_S  3
/** PCR_PCNT_READY : RO; bitpos: [4]; default: 1;
 *  Query this field after reset pcnt module
 */
#define PCR_PCNT_READY    (BIT(4))
#define PCR_PCNT_READY_M  (PCR_PCNT_READY_V << PCR_PCNT_READY_S)
#define PCR_PCNT_READY_V  0x00000001U
#define PCR_PCNT_READY_S  4
/** PCR_PCNT_CLK_SEL : R/W; bitpos: [6:5]; default: 0;
 *  Configures the clock source of the pcnt.
 *  0 (default): XTAL_CLK
 *  1: RC_FAST_CLK
 *  2: PLL_F32M_CLK
 */
#define PCR_PCNT_CLK_SEL    0x00000003U
#define PCR_PCNT_CLK_SEL_M  (PCR_PCNT_CLK_SEL_V << PCR_PCNT_CLK_SEL_S)
#define PCR_PCNT_CLK_SEL_V  0x00000003U
#define PCR_PCNT_CLK_SEL_S  5
/** PCR_PCNT_CLK_DIV_NUM : R/W; bitpos: [10:7]; default: 0;
 *  The integral part of the frequency divider factor of the pcnt function clock.
 */
#define PCR_PCNT_CLK_DIV_NUM    0x0000000FU
#define PCR_PCNT_CLK_DIV_NUM_M  (PCR_PCNT_CLK_DIV_NUM_V << PCR_PCNT_CLK_DIV_NUM_S)
#define PCR_PCNT_CLK_DIV_NUM_V  0x0000000FU
#define PCR_PCNT_CLK_DIV_NUM_S  7

/** PCR_ETM_CONF_REG register
 *  ETM configuration register
 */
#define PCR_ETM_CONF_REG (DR_REG_PCR_BASE + 0xa0)
/** PCR_ETM_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  Set 1 to enable etm clock
 */
#define PCR_ETM_CLK_EN    (BIT(0))
#define PCR_ETM_CLK_EN_M  (PCR_ETM_CLK_EN_V << PCR_ETM_CLK_EN_S)
#define PCR_ETM_CLK_EN_V  0x00000001U
#define PCR_ETM_CLK_EN_S  0
/** PCR_ETM_RST_EN : R/W; bitpos: [1]; default: 0;
 *  Set 1 to reset etm module
 */
#define PCR_ETM_RST_EN    (BIT(1))
#define PCR_ETM_RST_EN_M  (PCR_ETM_RST_EN_V << PCR_ETM_RST_EN_S)
#define PCR_ETM_RST_EN_V  0x00000001U
#define PCR_ETM_RST_EN_S  1
/** PCR_ETM_READY : RO; bitpos: [2]; default: 1;
 *  Query this field after reset etm module
 */
#define PCR_ETM_READY    (BIT(2))
#define PCR_ETM_READY_M  (PCR_ETM_READY_V << PCR_ETM_READY_S)
#define PCR_ETM_READY_V  0x00000001U
#define PCR_ETM_READY_S  2

/** PCR_PWM0_CONF_REG register
 *  PWM0 configuration register
 */
#define PCR_PWM0_CONF_REG (DR_REG_PCR_BASE + 0xa4)
/** PCR_PWM0_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  Set 1 to enable pwm0 clock
 */
#define PCR_PWM0_CLK_EN    (BIT(0))
#define PCR_PWM0_CLK_EN_M  (PCR_PWM0_CLK_EN_V << PCR_PWM0_CLK_EN_S)
#define PCR_PWM0_CLK_EN_V  0x00000001U
#define PCR_PWM0_CLK_EN_S  0
/** PCR_PWM0_RST_EN : R/W; bitpos: [1]; default: 0;
 *  Set 1 to reset pwm0 module
 */
#define PCR_PWM0_RST_EN    (BIT(1))
#define PCR_PWM0_RST_EN_M  (PCR_PWM0_RST_EN_V << PCR_PWM0_RST_EN_S)
#define PCR_PWM0_RST_EN_V  0x00000001U
#define PCR_PWM0_RST_EN_S  1
/** PCR_PWM0_READY : RO; bitpos: [2]; default: 1;
 *  Query this field after reset pwm0 module
 */
#define PCR_PWM0_READY    (BIT(2))
#define PCR_PWM0_READY_M  (PCR_PWM0_READY_V << PCR_PWM0_READY_S)
#define PCR_PWM0_READY_V  0x00000001U
#define PCR_PWM0_READY_S  2

/** PCR_PWM0_CLK_CONF_REG register
 *  PWM0_CLK configuration register
 */
#define PCR_PWM0_CLK_CONF_REG (DR_REG_PCR_BASE + 0xa8)
/** PCR_PWM0_DIV_NUM : R/W; bitpos: [19:12]; default: 4;
 *  The integral part of the frequency divider factor of the pwm0 function clock.
 */
#define PCR_PWM0_DIV_NUM    0x000000FFU
#define PCR_PWM0_DIV_NUM_M  (PCR_PWM0_DIV_NUM_V << PCR_PWM0_DIV_NUM_S)
#define PCR_PWM0_DIV_NUM_V  0x000000FFU
#define PCR_PWM0_DIV_NUM_S  12
/** PCR_PWM0_CLKM_SEL : R/W; bitpos: [21:20]; default: 0;
 *  Configures the clock source of MCPWM0.
 *  0 (default): XTAL_CLK
 *  1: RC_FAST_CLK
 *  2: PLL_F160M_CLK
 */
#define PCR_PWM0_CLKM_SEL    0x00000003U
#define PCR_PWM0_CLKM_SEL_M  (PCR_PWM0_CLKM_SEL_V << PCR_PWM0_CLKM_SEL_S)
#define PCR_PWM0_CLKM_SEL_V  0x00000003U
#define PCR_PWM0_CLKM_SEL_S  20
/** PCR_PWM0_CLKM_EN : R/W; bitpos: [22]; default: 0;
 *  set this field as 1 to activate pwm0 clkm.
 */
#define PCR_PWM0_CLKM_EN    (BIT(22))
#define PCR_PWM0_CLKM_EN_M  (PCR_PWM0_CLKM_EN_V << PCR_PWM0_CLKM_EN_S)
#define PCR_PWM0_CLKM_EN_V  0x00000001U
#define PCR_PWM0_CLKM_EN_S  22

/** PCR_PARL_IO_CONF_REG register
 *  PARL_IO configuration register
 */
#define PCR_PARL_IO_CONF_REG (DR_REG_PCR_BASE + 0xac)
/** PCR_PARL_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  Set 1 to enable parl apb clock
 */
#define PCR_PARL_CLK_EN    (BIT(0))
#define PCR_PARL_CLK_EN_M  (PCR_PARL_CLK_EN_V << PCR_PARL_CLK_EN_S)
#define PCR_PARL_CLK_EN_V  0x00000001U
#define PCR_PARL_CLK_EN_S  0
/** PCR_PARL_RST_EN : R/W; bitpos: [1]; default: 0;
 *  Set 1 to reset parl apb reg
 */
#define PCR_PARL_RST_EN    (BIT(1))
#define PCR_PARL_RST_EN_M  (PCR_PARL_RST_EN_V << PCR_PARL_RST_EN_S)
#define PCR_PARL_RST_EN_V  0x00000001U
#define PCR_PARL_RST_EN_S  1
/** PCR_PARL_READY : RO; bitpos: [2]; default: 1;
 *  Query this field after reset parl module
 */
#define PCR_PARL_READY    (BIT(2))
#define PCR_PARL_READY_M  (PCR_PARL_READY_V << PCR_PARL_READY_S)
#define PCR_PARL_READY_V  0x00000001U
#define PCR_PARL_READY_S  2

/** PCR_PARL_CLK_RX_CONF_REG register
 *  PARL_CLK_RX configuration register
 */
#define PCR_PARL_CLK_RX_CONF_REG (DR_REG_PCR_BASE + 0xb0)
/** PCR_PARL_CLK_RX_DIV_NUM : R/W; bitpos: [15:0]; default: 0;
 *  The integral part of the frequency divider factor of the parl rx clock.
 */
#define PCR_PARL_CLK_RX_DIV_NUM    0x0000FFFFU
#define PCR_PARL_CLK_RX_DIV_NUM_M  (PCR_PARL_CLK_RX_DIV_NUM_V << PCR_PARL_CLK_RX_DIV_NUM_S)
#define PCR_PARL_CLK_RX_DIV_NUM_V  0x0000FFFFU
#define PCR_PARL_CLK_RX_DIV_NUM_S  0
/** PCR_PARL_CLK_RX_SEL : R/W; bitpos: [17:16]; default: 0;
 *  Configures the clock source of Paraller IO RX
 *  0 (default): XTAL_CLK
 *  1: RC_FAST_CLK
 *  2: PLL_F240M_CLK
 *  3: Use the clock from chip pin
 */
#define PCR_PARL_CLK_RX_SEL    0x00000003U
#define PCR_PARL_CLK_RX_SEL_M  (PCR_PARL_CLK_RX_SEL_V << PCR_PARL_CLK_RX_SEL_S)
#define PCR_PARL_CLK_RX_SEL_V  0x00000003U
#define PCR_PARL_CLK_RX_SEL_S  16
/** PCR_PARL_CLK_RX_EN : R/W; bitpos: [18]; default: 0;
 *  Set 1 to enable parl rx clock
 */
#define PCR_PARL_CLK_RX_EN    (BIT(18))
#define PCR_PARL_CLK_RX_EN_M  (PCR_PARL_CLK_RX_EN_V << PCR_PARL_CLK_RX_EN_S)
#define PCR_PARL_CLK_RX_EN_V  0x00000001U
#define PCR_PARL_CLK_RX_EN_S  18
/** PCR_PARL_RX_RST_EN : R/W; bitpos: [19]; default: 0;
 *  Set 1 to reset parl rx module
 */
#define PCR_PARL_RX_RST_EN    (BIT(19))
#define PCR_PARL_RX_RST_EN_M  (PCR_PARL_RX_RST_EN_V << PCR_PARL_RX_RST_EN_S)
#define PCR_PARL_RX_RST_EN_V  0x00000001U
#define PCR_PARL_RX_RST_EN_S  19

/** PCR_PARL_CLK_TX_CONF_REG register
 *  PARL_CLK_TX configuration register
 */
#define PCR_PARL_CLK_TX_CONF_REG (DR_REG_PCR_BASE + 0xb4)
/** PCR_PARL_CLK_TX_DIV_NUM : R/W; bitpos: [15:0]; default: 0;
 *  The integral part of the frequency divider factor of the parl tx clock.
 */
#define PCR_PARL_CLK_TX_DIV_NUM    0x0000FFFFU
#define PCR_PARL_CLK_TX_DIV_NUM_M  (PCR_PARL_CLK_TX_DIV_NUM_V << PCR_PARL_CLK_TX_DIV_NUM_S)
#define PCR_PARL_CLK_TX_DIV_NUM_V  0x0000FFFFU
#define PCR_PARL_CLK_TX_DIV_NUM_S  0
/** PCR_PARL_CLK_TX_SEL : R/W; bitpos: [17:16]; default: 0;
 *  Configures the clock source of Paraller IO RX
 *  0 (default): XTAL_CLK
 *  1: RC_FAST_CLK
 *  2: PLL_F240M_CLK
 *  3: Use the clock from chip pin
 */
#define PCR_PARL_CLK_TX_SEL    0x00000003U
#define PCR_PARL_CLK_TX_SEL_M  (PCR_PARL_CLK_TX_SEL_V << PCR_PARL_CLK_TX_SEL_S)
#define PCR_PARL_CLK_TX_SEL_V  0x00000003U
#define PCR_PARL_CLK_TX_SEL_S  16
/** PCR_PARL_CLK_TX_EN : R/W; bitpos: [18]; default: 0;
 *  Set 1 to enable parl tx clock
 */
#define PCR_PARL_CLK_TX_EN    (BIT(18))
#define PCR_PARL_CLK_TX_EN_M  (PCR_PARL_CLK_TX_EN_V << PCR_PARL_CLK_TX_EN_S)
#define PCR_PARL_CLK_TX_EN_V  0x00000001U
#define PCR_PARL_CLK_TX_EN_S  18
/** PCR_PARL_TX_RST_EN : R/W; bitpos: [19]; default: 0;
 *  Set 1 to reset parl tx module
 */
#define PCR_PARL_TX_RST_EN    (BIT(19))
#define PCR_PARL_TX_RST_EN_M  (PCR_PARL_TX_RST_EN_V << PCR_PARL_TX_RST_EN_S)
#define PCR_PARL_TX_RST_EN_V  0x00000001U
#define PCR_PARL_TX_RST_EN_S  19

/** PCR_PVT_MONITOR_CONF_REG register
 *  PVT_MONITOR configuration register
 */
#define PCR_PVT_MONITOR_CONF_REG (DR_REG_PCR_BASE + 0xb8)
/** PCR_PVT_MONITOR_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  Set 1 to enable apb clock of pvt module
 */
#define PCR_PVT_MONITOR_CLK_EN    (BIT(0))
#define PCR_PVT_MONITOR_CLK_EN_M  (PCR_PVT_MONITOR_CLK_EN_V << PCR_PVT_MONITOR_CLK_EN_S)
#define PCR_PVT_MONITOR_CLK_EN_V  0x00000001U
#define PCR_PVT_MONITOR_CLK_EN_S  0
/** PCR_PVT_MONITOR_RST_EN : R/W; bitpos: [1]; default: 0;
 *  Set 1 to reset all pvt monitor module
 */
#define PCR_PVT_MONITOR_RST_EN    (BIT(1))
#define PCR_PVT_MONITOR_RST_EN_M  (PCR_PVT_MONITOR_RST_EN_V << PCR_PVT_MONITOR_RST_EN_S)
#define PCR_PVT_MONITOR_RST_EN_V  0x00000001U
#define PCR_PVT_MONITOR_RST_EN_S  1
/** PCR_PVT_MONITOR_SITE1_CLK_EN : R/W; bitpos: [2]; default: 1;
 *  Set 1 to enable function clock of modem pvt module
 */
#define PCR_PVT_MONITOR_SITE1_CLK_EN    (BIT(2))
#define PCR_PVT_MONITOR_SITE1_CLK_EN_M  (PCR_PVT_MONITOR_SITE1_CLK_EN_V << PCR_PVT_MONITOR_SITE1_CLK_EN_S)
#define PCR_PVT_MONITOR_SITE1_CLK_EN_V  0x00000001U
#define PCR_PVT_MONITOR_SITE1_CLK_EN_S  2
/** PCR_PVT_MONITOR_SITE2_CLK_EN : R/W; bitpos: [3]; default: 1;
 *  Set 1 to enable function clock of cpu pvt module
 */
#define PCR_PVT_MONITOR_SITE2_CLK_EN    (BIT(3))
#define PCR_PVT_MONITOR_SITE2_CLK_EN_M  (PCR_PVT_MONITOR_SITE2_CLK_EN_V << PCR_PVT_MONITOR_SITE2_CLK_EN_S)
#define PCR_PVT_MONITOR_SITE2_CLK_EN_V  0x00000001U
#define PCR_PVT_MONITOR_SITE2_CLK_EN_S  3
/** PCR_PVT_MONITOR_SITE3_CLK_EN : R/W; bitpos: [4]; default: 1;
 *  Set 1 to enable function clock of hp_peri pvt module
 */
#define PCR_PVT_MONITOR_SITE3_CLK_EN    (BIT(4))
#define PCR_PVT_MONITOR_SITE3_CLK_EN_M  (PCR_PVT_MONITOR_SITE3_CLK_EN_V << PCR_PVT_MONITOR_SITE3_CLK_EN_S)
#define PCR_PVT_MONITOR_SITE3_CLK_EN_V  0x00000001U
#define PCR_PVT_MONITOR_SITE3_CLK_EN_S  4

/** PCR_PVT_MONITOR_FUNC_CLK_CONF_REG register
 *  PVT_MONITOR function clock configuration register
 */
#define PCR_PVT_MONITOR_FUNC_CLK_CONF_REG (DR_REG_PCR_BASE + 0xbc)
/** PCR_PVT_MONITOR_FUNC_CLK_DIV_NUM : R/W; bitpos: [3:0]; default: 0;
 *  The integral part of the frequency divider factor of the pvt_monitor function clock.
 */
#define PCR_PVT_MONITOR_FUNC_CLK_DIV_NUM    0x0000000FU
#define PCR_PVT_MONITOR_FUNC_CLK_DIV_NUM_M  (PCR_PVT_MONITOR_FUNC_CLK_DIV_NUM_V << PCR_PVT_MONITOR_FUNC_CLK_DIV_NUM_S)
#define PCR_PVT_MONITOR_FUNC_CLK_DIV_NUM_V  0x0000000FU
#define PCR_PVT_MONITOR_FUNC_CLK_DIV_NUM_S  0
/** PCR_PVT_MONITOR_FUNC_CLK_SEL : R/W; bitpos: [20]; default: 1;
 *  Configures the clock source of PVT MONITOR.
 *  0: XTAL_CLK
 *  1(default): PLL_F160M_CLK
 */
#define PCR_PVT_MONITOR_FUNC_CLK_SEL    (BIT(20))
#define PCR_PVT_MONITOR_FUNC_CLK_SEL_M  (PCR_PVT_MONITOR_FUNC_CLK_SEL_V << PCR_PVT_MONITOR_FUNC_CLK_SEL_S)
#define PCR_PVT_MONITOR_FUNC_CLK_SEL_V  0x00000001U
#define PCR_PVT_MONITOR_FUNC_CLK_SEL_S  20
/** PCR_PVT_MONITOR_FUNC_CLK_EN : R/W; bitpos: [22]; default: 0;
 *  Set 1 to enable source clock of pvt sitex
 */
#define PCR_PVT_MONITOR_FUNC_CLK_EN    (BIT(22))
#define PCR_PVT_MONITOR_FUNC_CLK_EN_M  (PCR_PVT_MONITOR_FUNC_CLK_EN_V << PCR_PVT_MONITOR_FUNC_CLK_EN_S)
#define PCR_PVT_MONITOR_FUNC_CLK_EN_V  0x00000001U
#define PCR_PVT_MONITOR_FUNC_CLK_EN_S  22

/** PCR_GDMA_CONF_REG register
 *  GDMA configuration register
 */
#define PCR_GDMA_CONF_REG (DR_REG_PCR_BASE + 0xc0)
/** PCR_GDMA_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  Set 1 to enable gdma clock
 */
#define PCR_GDMA_CLK_EN    (BIT(0))
#define PCR_GDMA_CLK_EN_M  (PCR_GDMA_CLK_EN_V << PCR_GDMA_CLK_EN_S)
#define PCR_GDMA_CLK_EN_V  0x00000001U
#define PCR_GDMA_CLK_EN_S  0
/** PCR_GDMA_RST_EN : R/W; bitpos: [1]; default: 0;
 *  Set 1 to reset gdma module
 */
#define PCR_GDMA_RST_EN    (BIT(1))
#define PCR_GDMA_RST_EN_M  (PCR_GDMA_RST_EN_V << PCR_GDMA_RST_EN_S)
#define PCR_GDMA_RST_EN_V  0x00000001U
#define PCR_GDMA_RST_EN_S  1

/** PCR_SPI2_CONF_REG register
 *  SPI2 configuration register
 */
#define PCR_SPI2_CONF_REG (DR_REG_PCR_BASE + 0xc4)
/** PCR_SPI2_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  Set 1 to enable spi2 apb clock
 */
#define PCR_SPI2_CLK_EN    (BIT(0))
#define PCR_SPI2_CLK_EN_M  (PCR_SPI2_CLK_EN_V << PCR_SPI2_CLK_EN_S)
#define PCR_SPI2_CLK_EN_V  0x00000001U
#define PCR_SPI2_CLK_EN_S  0
/** PCR_SPI2_RST_EN : R/W; bitpos: [1]; default: 0;
 *  Set 1 to reset spi2 module
 */
#define PCR_SPI2_RST_EN    (BIT(1))
#define PCR_SPI2_RST_EN_M  (PCR_SPI2_RST_EN_V << PCR_SPI2_RST_EN_S)
#define PCR_SPI2_RST_EN_V  0x00000001U
#define PCR_SPI2_RST_EN_S  1
/** PCR_SPI2_READY : RO; bitpos: [2]; default: 1;
 *  Query this field after reset spi2 module
 */
#define PCR_SPI2_READY    (BIT(2))
#define PCR_SPI2_READY_M  (PCR_SPI2_READY_V << PCR_SPI2_READY_S)
#define PCR_SPI2_READY_V  0x00000001U
#define PCR_SPI2_READY_S  2

/** PCR_SPI2_CLKM_CONF_REG register
 *  SPI2_CLKM configuration register
 */
#define PCR_SPI2_CLKM_CONF_REG (DR_REG_PCR_BASE + 0xc8)
/** PCR_SPI2_CLKM_DIV_NUM : R/W; bitpos: [19:12]; default: 0;
 *  The integral part of the frequency divider factor of the spi2_mst clock.
 */
#define PCR_SPI2_CLKM_DIV_NUM    0x000000FFU
#define PCR_SPI2_CLKM_DIV_NUM_M  (PCR_SPI2_CLKM_DIV_NUM_V << PCR_SPI2_CLKM_DIV_NUM_S)
#define PCR_SPI2_CLKM_DIV_NUM_V  0x000000FFU
#define PCR_SPI2_CLKM_DIV_NUM_S  12
/** PCR_SPI2_CLKM_SEL : R/W; bitpos: [21:20]; default: 0;
 *  Configures the clock source of SPI2.
 *  0 (default): XTAL_CLK
 *  1: PLL_F48M_CLK
 *  2: RC_FAST_CLK
 */
#define PCR_SPI2_CLKM_SEL    0x00000003U
#define PCR_SPI2_CLKM_SEL_M  (PCR_SPI2_CLKM_SEL_V << PCR_SPI2_CLKM_SEL_S)
#define PCR_SPI2_CLKM_SEL_V  0x00000003U
#define PCR_SPI2_CLKM_SEL_S  20
/** PCR_SPI2_CLKM_EN : R/W; bitpos: [22]; default: 1;
 *  Set 1 to enable spi2 function clock
 */
#define PCR_SPI2_CLKM_EN    (BIT(22))
#define PCR_SPI2_CLKM_EN_M  (PCR_SPI2_CLKM_EN_V << PCR_SPI2_CLKM_EN_S)
#define PCR_SPI2_CLKM_EN_V  0x00000001U
#define PCR_SPI2_CLKM_EN_S  22

/** PCR_AES_CONF_REG register
 *  AES configuration register
 */
#define PCR_AES_CONF_REG (DR_REG_PCR_BASE + 0xcc)
/** PCR_AES_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  Set 1 to enable aes clock
 */
#define PCR_AES_CLK_EN    (BIT(0))
#define PCR_AES_CLK_EN_M  (PCR_AES_CLK_EN_V << PCR_AES_CLK_EN_S)
#define PCR_AES_CLK_EN_V  0x00000001U
#define PCR_AES_CLK_EN_S  0
/** PCR_AES_RST_EN : R/W; bitpos: [1]; default: 0;
 *  Set 1 to reset aes module
 */
#define PCR_AES_RST_EN    (BIT(1))
#define PCR_AES_RST_EN_M  (PCR_AES_RST_EN_V << PCR_AES_RST_EN_S)
#define PCR_AES_RST_EN_V  0x00000001U
#define PCR_AES_RST_EN_S  1
/** PCR_AES_READY : RO; bitpos: [2]; default: 1;
 *  Query this field after reset aes module
 */
#define PCR_AES_READY    (BIT(2))
#define PCR_AES_READY_M  (PCR_AES_READY_V << PCR_AES_READY_S)
#define PCR_AES_READY_V  0x00000001U
#define PCR_AES_READY_S  2

/** PCR_SHA_CONF_REG register
 *  SHA configuration register
 */
#define PCR_SHA_CONF_REG (DR_REG_PCR_BASE + 0xd0)
/** PCR_SHA_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  Set 1 to enable sha clock
 */
#define PCR_SHA_CLK_EN    (BIT(0))
#define PCR_SHA_CLK_EN_M  (PCR_SHA_CLK_EN_V << PCR_SHA_CLK_EN_S)
#define PCR_SHA_CLK_EN_V  0x00000001U
#define PCR_SHA_CLK_EN_S  0
/** PCR_SHA_RST_EN : R/W; bitpos: [1]; default: 0;
 *  Set 1 to reset sha module
 */
#define PCR_SHA_RST_EN    (BIT(1))
#define PCR_SHA_RST_EN_M  (PCR_SHA_RST_EN_V << PCR_SHA_RST_EN_S)
#define PCR_SHA_RST_EN_V  0x00000001U
#define PCR_SHA_RST_EN_S  1
/** PCR_SHA_READY : RO; bitpos: [2]; default: 1;
 *  Query this field after reset sha module
 */
#define PCR_SHA_READY    (BIT(2))
#define PCR_SHA_READY_M  (PCR_SHA_READY_V << PCR_SHA_READY_S)
#define PCR_SHA_READY_V  0x00000001U
#define PCR_SHA_READY_S  2

/** PCR_ECC_CONF_REG register
 *  ECC configuration register
 */
#define PCR_ECC_CONF_REG (DR_REG_PCR_BASE + 0xdc)
/** PCR_ECC_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  Set 1 to enable ecc clock
 */
#define PCR_ECC_CLK_EN    (BIT(0))
#define PCR_ECC_CLK_EN_M  (PCR_ECC_CLK_EN_V << PCR_ECC_CLK_EN_S)
#define PCR_ECC_CLK_EN_V  0x00000001U
#define PCR_ECC_CLK_EN_S  0
/** PCR_ECC_RST_EN : R/W; bitpos: [1]; default: 0;
 *  Set 1 to reset ecc module
 */
#define PCR_ECC_RST_EN    (BIT(1))
#define PCR_ECC_RST_EN_M  (PCR_ECC_RST_EN_V << PCR_ECC_RST_EN_S)
#define PCR_ECC_RST_EN_V  0x00000001U
#define PCR_ECC_RST_EN_S  1
/** PCR_ECC_READY : RO; bitpos: [2]; default: 1;
 *  Query this field after reset ecc module
 */
#define PCR_ECC_READY    (BIT(2))
#define PCR_ECC_READY_M  (PCR_ECC_READY_V << PCR_ECC_READY_S)
#define PCR_ECC_READY_V  0x00000001U
#define PCR_ECC_READY_S  2

/** PCR_ECC_MEM_LP_CTRL_REG register
 *  HP CORE0 & HP CORE1 memory power control register
 */
#define PCR_ECC_MEM_LP_CTRL_REG (DR_REG_PCR_BASE + 0xe0)
/** PCR_ECC_MEM_LP_MODE : R/W; bitpos: [1:0]; default: 2;
 *  Configures ecc memory low power mode in low power stage.
 *  0: deep sleep
 *  1: light sleep
 *  2(default): shut down
 *  3: disable low power stage
 */
#define PCR_ECC_MEM_LP_MODE    0x00000003U
#define PCR_ECC_MEM_LP_MODE_M  (PCR_ECC_MEM_LP_MODE_V << PCR_ECC_MEM_LP_MODE_S)
#define PCR_ECC_MEM_LP_MODE_V  0x00000003U
#define PCR_ECC_MEM_LP_MODE_S  0
/** PCR_ECC_MEM_LP_EN : R/W; bitpos: [2]; default: 0;
 *  Set this bit to power down ecc memory.
 */
#define PCR_ECC_MEM_LP_EN    (BIT(2))
#define PCR_ECC_MEM_LP_EN_M  (PCR_ECC_MEM_LP_EN_V << PCR_ECC_MEM_LP_EN_S)
#define PCR_ECC_MEM_LP_EN_V  0x00000001U
#define PCR_ECC_MEM_LP_EN_S  2
/** PCR_ECC_MEM_FORCE_CTRL : R/W; bitpos: [3]; default: 0;
 *  Set this bit to force software control ecc memory, disable hardware control.
 */
#define PCR_ECC_MEM_FORCE_CTRL    (BIT(3))
#define PCR_ECC_MEM_FORCE_CTRL_M  (PCR_ECC_MEM_FORCE_CTRL_V << PCR_ECC_MEM_FORCE_CTRL_S)
#define PCR_ECC_MEM_FORCE_CTRL_V  0x00000001U
#define PCR_ECC_MEM_FORCE_CTRL_S  3

/** PCR_HMAC_CONF_REG register
 *  HMAC configuration register
 */
#define PCR_HMAC_CONF_REG (DR_REG_PCR_BASE + 0xe8)
/** PCR_HMAC_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  Set 1 to enable hmac clock
 */
#define PCR_HMAC_CLK_EN    (BIT(0))
#define PCR_HMAC_CLK_EN_M  (PCR_HMAC_CLK_EN_V << PCR_HMAC_CLK_EN_S)
#define PCR_HMAC_CLK_EN_V  0x00000001U
#define PCR_HMAC_CLK_EN_S  0
/** PCR_HMAC_RST_EN : R/W; bitpos: [1]; default: 0;
 *  Set 1 to reset hmac module
 */
#define PCR_HMAC_RST_EN    (BIT(1))
#define PCR_HMAC_RST_EN_M  (PCR_HMAC_RST_EN_V << PCR_HMAC_RST_EN_S)
#define PCR_HMAC_RST_EN_V  0x00000001U
#define PCR_HMAC_RST_EN_S  1
/** PCR_HMAC_READY : RO; bitpos: [2]; default: 1;
 *  Query this field after reset hmac module
 */
#define PCR_HMAC_READY    (BIT(2))
#define PCR_HMAC_READY_M  (PCR_HMAC_READY_V << PCR_HMAC_READY_S)
#define PCR_HMAC_READY_V  0x00000001U
#define PCR_HMAC_READY_S  2

/** PCR_ECDSA_CONF_REG register
 *  ECDSA configuration register
 */
#define PCR_ECDSA_CONF_REG (DR_REG_PCR_BASE + 0xec)
/** PCR_ECDSA_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  Set 1 to enable ecdsa clock
 */
#define PCR_ECDSA_CLK_EN    (BIT(0))
#define PCR_ECDSA_CLK_EN_M  (PCR_ECDSA_CLK_EN_V << PCR_ECDSA_CLK_EN_S)
#define PCR_ECDSA_CLK_EN_V  0x00000001U
#define PCR_ECDSA_CLK_EN_S  0
/** PCR_ECDSA_RST_EN : R/W; bitpos: [1]; default: 0;
 *  Set 1 to reset ecdsa module
 */
#define PCR_ECDSA_RST_EN    (BIT(1))
#define PCR_ECDSA_RST_EN_M  (PCR_ECDSA_RST_EN_V << PCR_ECDSA_RST_EN_S)
#define PCR_ECDSA_RST_EN_V  0x00000001U
#define PCR_ECDSA_RST_EN_S  1
/** PCR_ECDSA_READY : RO; bitpos: [2]; default: 1;
 *  Query this field after reset ecdsa module
 */
#define PCR_ECDSA_READY    (BIT(2))
#define PCR_ECDSA_READY_M  (PCR_ECDSA_READY_V << PCR_ECDSA_READY_S)
#define PCR_ECDSA_READY_V  0x00000001U
#define PCR_ECDSA_READY_S  2

