espressif/esp-idf/components/soc/esp32h4/register/soc/pcr_reg.h
/** PCR_IOMUX_CONF_REG register
 *  IOMUX configuration register
 */
#define PCR_IOMUX_CONF_REG (DR_REG_PCR_BASE + 0xf0)
/** PCR_IOMUX_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  Set 1 to enable iomux apb clock
 */
#define PCR_IOMUX_CLK_EN    (BIT(0))
#define PCR_IOMUX_CLK_EN_M  (PCR_IOMUX_CLK_EN_V << PCR_IOMUX_CLK_EN_S)
#define PCR_IOMUX_CLK_EN_V  0x00000001U
#define PCR_IOMUX_CLK_EN_S  0
/** PCR_IOMUX_RST_EN : R/W; bitpos: [1]; default: 0;
 *  Set 1 to reset iomux module
 */
#define PCR_IOMUX_RST_EN    (BIT(1))
#define PCR_IOMUX_RST_EN_M  (PCR_IOMUX_RST_EN_V << PCR_IOMUX_RST_EN_S)
#define PCR_IOMUX_RST_EN_V  0x00000001U
#define PCR_IOMUX_RST_EN_S  1

/** PCR_IOMUX_CLK_CONF_REG register
 *  IOMUX_CLK configuration register
 */
#define PCR_IOMUX_CLK_CONF_REG (DR_REG_PCR_BASE + 0xf4)
/** PCR_IOMUX_FUNC_CLK_SEL : R/W; bitpos: [21:20]; default: 0;
 *  Configures the clock source of IO MUX.
 *  0 (default): XTAL_CLK
 *  1: RC_FAST_CLK
 *  2: PLL_F80M_CLK
 */
#define PCR_IOMUX_FUNC_CLK_SEL    0x00000003U
#define PCR_IOMUX_FUNC_CLK_SEL_M  (PCR_IOMUX_FUNC_CLK_SEL_V << PCR_IOMUX_FUNC_CLK_SEL_S)
#define PCR_IOMUX_FUNC_CLK_SEL_V  0x00000003U
#define PCR_IOMUX_FUNC_CLK_SEL_S  20
/** PCR_IOMUX_FUNC_CLK_EN : R/W; bitpos: [22]; default: 1;
 *  Set 1 to enable iomux function clock
 */
#define PCR_IOMUX_FUNC_CLK_EN    (BIT(22))
#define PCR_IOMUX_FUNC_CLK_EN_M  (PCR_IOMUX_FUNC_CLK_EN_V << PCR_IOMUX_FUNC_CLK_EN_S)
#define PCR_IOMUX_FUNC_CLK_EN_V  0x00000001U
#define PCR_IOMUX_FUNC_CLK_EN_S  22

/** PCR_REGDMA_CONF_REG register
 *  REGDMA configuration register
 */
#define PCR_REGDMA_CONF_REG (DR_REG_PCR_BASE + 0xf8)
/** PCR_REGDMA_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  Set 1 to enable regdma clock
 */
#define PCR_REGDMA_CLK_EN    (BIT(0))
#define PCR_REGDMA_CLK_EN_M  (PCR_REGDMA_CLK_EN_V << PCR_REGDMA_CLK_EN_S)
#define PCR_REGDMA_CLK_EN_V  0x00000001U
#define PCR_REGDMA_CLK_EN_S  0
/** PCR_REGDMA_RST_EN : R/W; bitpos: [1]; default: 0;
 *  Set 1 to reset regdma module
 */
#define PCR_REGDMA_RST_EN    (BIT(1))
#define PCR_REGDMA_RST_EN_M  (PCR_REGDMA_RST_EN_V << PCR_REGDMA_RST_EN_S)
#define PCR_REGDMA_RST_EN_V  0x00000001U
#define PCR_REGDMA_RST_EN_S  1
/** PCR_REGDMA_MAC_CLK_EN : R/W; bitpos: [2]; default: 1;
 *  Set 1 to enable modem control regdma clock relate logic clock
 */
#define PCR_REGDMA_MAC_CLK_EN    (BIT(2))
#define PCR_REGDMA_MAC_CLK_EN_M  (PCR_REGDMA_MAC_CLK_EN_V << PCR_REGDMA_MAC_CLK_EN_S)
#define PCR_REGDMA_MAC_CLK_EN_V  0x00000001U
#define PCR_REGDMA_MAC_CLK_EN_S  2

/** PCR_TRACE_CONF_REG register
 *  TRACE configuration register
 */
#define PCR_TRACE_CONF_REG (DR_REG_PCR_BASE + 0xfc)
/** PCR_TRACE_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  Set 1 to enable core0 trace clock
 */
#define PCR_TRACE_CLK_EN    (BIT(0))
#define PCR_TRACE_CLK_EN_M  (PCR_TRACE_CLK_EN_V << PCR_TRACE_CLK_EN_S)
#define PCR_TRACE_CLK_EN_V  0x00000001U
#define PCR_TRACE_CLK_EN_S  0
/** PCR_TRACE_RST_EN : R/W; bitpos: [1]; default: 1;
 *  Set 1 to reset core0 trace module
 */
#define PCR_TRACE_RST_EN    (BIT(1))
#define PCR_TRACE_RST_EN_M  (PCR_TRACE_RST_EN_V << PCR_TRACE_RST_EN_S)
#define PCR_TRACE_RST_EN_V  0x00000001U
#define PCR_TRACE_RST_EN_S  1
/** PCR_TRACE1_CLK_EN : R/W; bitpos: [2]; default: 0;
 *  Set 1 to enable core1 trace clock
 */
#define PCR_TRACE1_CLK_EN    (BIT(2))
#define PCR_TRACE1_CLK_EN_M  (PCR_TRACE1_CLK_EN_V << PCR_TRACE1_CLK_EN_S)
#define PCR_TRACE1_CLK_EN_V  0x00000001U
#define PCR_TRACE1_CLK_EN_S  2
/** PCR_TRACE1_RST_EN : R/W; bitpos: [3]; default: 1;
 *  Set 1 to reset core1 trace module
 */
#define PCR_TRACE1_RST_EN    (BIT(3))
#define PCR_TRACE1_RST_EN_M  (PCR_TRACE1_RST_EN_V << PCR_TRACE1_RST_EN_S)
#define PCR_TRACE1_RST_EN_V  0x00000001U
#define PCR_TRACE1_RST_EN_S  3

/** PCR_ASSIST_CONF_REG register
 *  ASSIST configuration register
 */
#define PCR_ASSIST_CONF_REG (DR_REG_PCR_BASE + 0x100)
/** PCR_ASSIST_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  Set 1 to enable core0 assist clock
 */
#define PCR_ASSIST_CLK_EN    (BIT(0))
#define PCR_ASSIST_CLK_EN_M  (PCR_ASSIST_CLK_EN_V << PCR_ASSIST_CLK_EN_S)
#define PCR_ASSIST_CLK_EN_V  0x00000001U
#define PCR_ASSIST_CLK_EN_S  0
/** PCR_ASSIST_RST_EN : R/W; bitpos: [1]; default: 0;
 *  Set 1 to reset core0 assist module
 */
#define PCR_ASSIST_RST_EN    (BIT(1))
#define PCR_ASSIST_RST_EN_M  (PCR_ASSIST_RST_EN_V << PCR_ASSIST_RST_EN_S)
#define PCR_ASSIST_RST_EN_V  0x00000001U
#define PCR_ASSIST_RST_EN_S  1
/** PCR_ASSIST1_CLK_EN : R/W; bitpos: [2]; default: 0;
 *  Set 1 to enable core1 assist clock
 */
#define PCR_ASSIST1_CLK_EN    (BIT(2))
#define PCR_ASSIST1_CLK_EN_M  (PCR_ASSIST1_CLK_EN_V << PCR_ASSIST1_CLK_EN_S)
#define PCR_ASSIST1_CLK_EN_V  0x00000001U
#define PCR_ASSIST1_CLK_EN_S  2
/** PCR_ASSIST1_RST_EN : R/W; bitpos: [3]; default: 1;
 *  Set 1 to reset core1 assist module
 */
#define PCR_ASSIST1_RST_EN    (BIT(3))
#define PCR_ASSIST1_RST_EN_M  (PCR_ASSIST1_RST_EN_V << PCR_ASSIST1_RST_EN_S)
#define PCR_ASSIST1_RST_EN_V  0x00000001U
#define PCR_ASSIST1_RST_EN_S  3

/** PCR_CACHE_CONF_REG register
 *  CACHE configuration register
 */
#define PCR_CACHE_CONF_REG (DR_REG_PCR_BASE + 0x104)
/** PCR_ICACHE0_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  Set 1 to enable icache0 clock
 */
#define PCR_ICACHE0_CLK_EN    (BIT(0))
#define PCR_ICACHE0_CLK_EN_M  (PCR_ICACHE0_CLK_EN_V << PCR_ICACHE0_CLK_EN_S)
#define PCR_ICACHE0_CLK_EN_V  0x00000001U
#define PCR_ICACHE0_CLK_EN_S  0
/** PCR_ICACHE1_CLK_EN : R/W; bitpos: [1]; default: 1;
 *  Set 1 to enable icache1 clock
 */
#define PCR_ICACHE1_CLK_EN    (BIT(1))
#define PCR_ICACHE1_CLK_EN_M  (PCR_ICACHE1_CLK_EN_V << PCR_ICACHE1_CLK_EN_S)
#define PCR_ICACHE1_CLK_EN_V  0x00000001U
#define PCR_ICACHE1_CLK_EN_S  1
/** PCR_DCACHE_CLK_EN : R/W; bitpos: [2]; default: 1;
 *  Set 1 to enable dcache clock
 */
#define PCR_DCACHE_CLK_EN    (BIT(2))
#define PCR_DCACHE_CLK_EN_M  (PCR_DCACHE_CLK_EN_V << PCR_DCACHE_CLK_EN_S)
#define PCR_DCACHE_CLK_EN_V  0x00000001U
#define PCR_DCACHE_CLK_EN_S  2
/** PCR_ICACHE0_RST_EN : R/W; bitpos: [3]; default: 0;
 *  Set 1 to reset icache0 module
 */
#define PCR_ICACHE0_RST_EN    (BIT(3))
#define PCR_ICACHE0_RST_EN_M  (PCR_ICACHE0_RST_EN_V << PCR_ICACHE0_RST_EN_S)
#define PCR_ICACHE0_RST_EN_V  0x00000001U
#define PCR_ICACHE0_RST_EN_S  3
/** PCR_ICACHE1_RST_EN : R/W; bitpos: [4]; default: 0;
 *  Set 1 to reset icache1 module
 */
#define PCR_ICACHE1_RST_EN    (BIT(4))
#define PCR_ICACHE1_RST_EN_M  (PCR_ICACHE1_RST_EN_V << PCR_ICACHE1_RST_EN_S)
#define PCR_ICACHE1_RST_EN_V  0x00000001U
#define PCR_ICACHE1_RST_EN_S  4
/** PCR_DCACHE_RST_EN : R/W; bitpos: [5]; default: 0;
 *  Set 1 to reset dcache module
 */
#define PCR_DCACHE_RST_EN    (BIT(5))
#define PCR_DCACHE_RST_EN_M  (PCR_DCACHE_RST_EN_V << PCR_DCACHE_RST_EN_S)
#define PCR_DCACHE_RST_EN_V  0x00000001U
#define PCR_DCACHE_RST_EN_S  5
/** PCR_CACHE_RST_EN : R/W; bitpos: [8]; default: 0;
 *  Set 1 to reset total cache module
 */
#define PCR_CACHE_RST_EN    (BIT(8))
#define PCR_CACHE_RST_EN_M  (PCR_CACHE_RST_EN_V << PCR_CACHE_RST_EN_S)
#define PCR_CACHE_RST_EN_V  0x00000001U
#define PCR_CACHE_RST_EN_S  8

