espressif/esp-idf/components/soc/esp32h4/register/soc/pcr_reg.h
/** PCR_CACHE_MEM_LP_CTRL_REG register
 *  HP CORE0 & HP CORE1 memory power control register
 */
#define PCR_CACHE_MEM_LP_CTRL_REG (DR_REG_PCR_BASE + 0x108)
/** PCR_L1_CACHE_MEM_LP_MODE : R/W; bitpos: [1:0]; default: 0;
 *  Configures l1_cache memory low power mode in low power stage.
 *  0(default): deep sleep
 *  1: light sleep
 *  2: shut down
 *  3: disable low power stage
 */
#define PCR_L1_CACHE_MEM_LP_MODE    0x00000003U
#define PCR_L1_CACHE_MEM_LP_MODE_M  (PCR_L1_CACHE_MEM_LP_MODE_V << PCR_L1_CACHE_MEM_LP_MODE_S)
#define PCR_L1_CACHE_MEM_LP_MODE_V  0x00000003U
#define PCR_L1_CACHE_MEM_LP_MODE_S  0
/** PCR_L1_CACHE_MEM_LP_EN : R/W; bitpos: [2]; default: 0;
 *  Set this bit to power down l1_cache memory.
 */
#define PCR_L1_CACHE_MEM_LP_EN    (BIT(2))
#define PCR_L1_CACHE_MEM_LP_EN_M  (PCR_L1_CACHE_MEM_LP_EN_V << PCR_L1_CACHE_MEM_LP_EN_S)
#define PCR_L1_CACHE_MEM_LP_EN_V  0x00000001U
#define PCR_L1_CACHE_MEM_LP_EN_S  2
/** PCR_L1_CACHE_MEM_FORCE_CTRL : R/W; bitpos: [3]; default: 0;
 *  Set this bit to force software control l1_cache memory, disable hardware control.
 */
#define PCR_L1_CACHE_MEM_FORCE_CTRL    (BIT(3))
#define PCR_L1_CACHE_MEM_FORCE_CTRL_M  (PCR_L1_CACHE_MEM_FORCE_CTRL_V << PCR_L1_CACHE_MEM_FORCE_CTRL_S)
#define PCR_L1_CACHE_MEM_FORCE_CTRL_V  0x00000001U
#define PCR_L1_CACHE_MEM_FORCE_CTRL_S  3

/** PCR_MODEM_CONF_REG register
 *  MODEM_APB configuration register
 */
#define PCR_MODEM_CONF_REG (DR_REG_PCR_BASE + 0x10c)
/** PCR_MODEM_CLK_SEL : R/W; bitpos: [0]; default: 0;
 *  xxxx
 */
#define PCR_MODEM_CLK_SEL    (BIT(0))
#define PCR_MODEM_CLK_SEL_M  (PCR_MODEM_CLK_SEL_V << PCR_MODEM_CLK_SEL_S)
#define PCR_MODEM_CLK_SEL_V  0x00000001U
#define PCR_MODEM_CLK_SEL_S  0
/** PCR_MODEM_CLK_EN : R/W; bitpos: [1]; default: 1;
 *  xxxx
 */
#define PCR_MODEM_CLK_EN    (BIT(1))
#define PCR_MODEM_CLK_EN_M  (PCR_MODEM_CLK_EN_V << PCR_MODEM_CLK_EN_S)
#define PCR_MODEM_CLK_EN_V  0x00000001U
#define PCR_MODEM_CLK_EN_S  1
/** PCR_MODEM_RST_EN : R/W; bitpos: [2]; default: 0;
 *  Set this file as 1 to reset modem-subsystem.
 */
#define PCR_MODEM_RST_EN    (BIT(2))
#define PCR_MODEM_RST_EN_M  (PCR_MODEM_RST_EN_V << PCR_MODEM_RST_EN_S)
#define PCR_MODEM_RST_EN_V  0x00000001U
#define PCR_MODEM_RST_EN_S  2

/** PCR_TIMEOUT_CONF_REG register
 *  TIMEOUT configuration register
 */
#define PCR_TIMEOUT_CONF_REG (DR_REG_PCR_BASE + 0x110)
/** PCR_CPU_TIMEOUT_RST_EN : R/W; bitpos: [1]; default: 0;
 *  Set 1 to reset cpu_peri timeout module
 */
#define PCR_CPU_TIMEOUT_RST_EN    (BIT(1))
#define PCR_CPU_TIMEOUT_RST_EN_M  (PCR_CPU_TIMEOUT_RST_EN_V << PCR_CPU_TIMEOUT_RST_EN_S)
#define PCR_CPU_TIMEOUT_RST_EN_V  0x00000001U
#define PCR_CPU_TIMEOUT_RST_EN_S  1
/** PCR_HP_TIMEOUT_RST_EN : R/W; bitpos: [2]; default: 0;
 *  Set 1 to reset hp_peri timeout module and hp_modem timeout module
 */
#define PCR_HP_TIMEOUT_RST_EN    (BIT(2))
#define PCR_HP_TIMEOUT_RST_EN_M  (PCR_HP_TIMEOUT_RST_EN_V << PCR_HP_TIMEOUT_RST_EN_S)
#define PCR_HP_TIMEOUT_RST_EN_V  0x00000001U
#define PCR_HP_TIMEOUT_RST_EN_S  2

/** PCR_SYSCLK_CONF_REG register
 *  SYSCLK configuration register
 */
#define PCR_SYSCLK_CONF_REG (DR_REG_PCR_BASE + 0x114)
/** PCR_SOC_CLK_SEL : R/W; bitpos: [17:16]; default: 0;
 *  Configures to select the clock source of HP_ROOT_CLK.
 *  0 (default): XTAL_CLK
 *  1: RC_FAST_CLK
 *  2: PLL_F160M_CLK
 *  2: PLL_F240M_CLK
 */
#define PCR_SOC_CLK_SEL    0x00000003U
#define PCR_SOC_CLK_SEL_M  (PCR_SOC_CLK_SEL_V << PCR_SOC_CLK_SEL_S)
#define PCR_SOC_CLK_SEL_V  0x00000003U
#define PCR_SOC_CLK_SEL_S  16
/** PCR_CLK_XTAL_FREQ : HRO; bitpos: [30:24]; default: 32;
 *  This field indicates the frequency(MHz) of XTAL.
 */
#define PCR_CLK_XTAL_FREQ    0x0000007FU
#define PCR_CLK_XTAL_FREQ_M  (PCR_CLK_XTAL_FREQ_V << PCR_CLK_XTAL_FREQ_S)
#define PCR_CLK_XTAL_FREQ_V  0x0000007FU
#define PCR_CLK_XTAL_FREQ_S  24
/** PCR_CPU_DBGMD_CLK_EN : R/W; bitpos: [31]; default: 1;
 *  This field indicates if cpu debug mode clock is enable. 0: disable, 1:
 *  enable(default).
 */
#define PCR_CPU_DBGMD_CLK_EN    (BIT(31))
#define PCR_CPU_DBGMD_CLK_EN_M  (PCR_CPU_DBGMD_CLK_EN_V << PCR_CPU_DBGMD_CLK_EN_S)
#define PCR_CPU_DBGMD_CLK_EN_V  0x00000001U
#define PCR_CPU_DBGMD_CLK_EN_S  31

/** PCR_CPU_WAITI_CONF_REG register
 *  CPU_WAITI configuration register
 */
#define PCR_CPU_WAITI_CONF_REG (DR_REG_PCR_BASE + 0x118)
/** PCR_CPU1_WAIT_MODE_FORCE_ON : R/W; bitpos: [3]; default: 1;
 *  Set 1 to force cpu1_waiti_clk enable.
 */
#define PCR_CPU1_WAIT_MODE_FORCE_ON    (BIT(3))
#define PCR_CPU1_WAIT_MODE_FORCE_ON_M  (PCR_CPU1_WAIT_MODE_FORCE_ON_V << PCR_CPU1_WAIT_MODE_FORCE_ON_S)
#define PCR_CPU1_WAIT_MODE_FORCE_ON_V  0x00000001U
#define PCR_CPU1_WAIT_MODE_FORCE_ON_S  3
/** PCR_CPU0_WAIT_MODE_FORCE_ON : R/W; bitpos: [4]; default: 1;
 *  Set 1 to force cpu0_waiti_clk enable.
 */
#define PCR_CPU0_WAIT_MODE_FORCE_ON    (BIT(4))
#define PCR_CPU0_WAIT_MODE_FORCE_ON_M  (PCR_CPU0_WAIT_MODE_FORCE_ON_V << PCR_CPU0_WAIT_MODE_FORCE_ON_S)
#define PCR_CPU0_WAIT_MODE_FORCE_ON_V  0x00000001U
#define PCR_CPU0_WAIT_MODE_FORCE_ON_S  4
/** PCR_CPU_WAITI_DELAY_NUM : R/W; bitpos: [8:5]; default: 0;
 *  This field used to set delay cycle when cpu enter waiti mode, after delay waiti_clk
 *  will close
 */
#define PCR_CPU_WAITI_DELAY_NUM    0x0000000FU
#define PCR_CPU_WAITI_DELAY_NUM_M  (PCR_CPU_WAITI_DELAY_NUM_V << PCR_CPU_WAITI_DELAY_NUM_S)
#define PCR_CPU_WAITI_DELAY_NUM_V  0x0000000FU
#define PCR_CPU_WAITI_DELAY_NUM_S  5
/** PCR_CPU_WFI_DECREASE_EN : R/W; bitpos: [9]; default: 0;
 *  Set 1 to enable cpu freq decrease to ahb freq when cpu enter waiti mode
 */
#define PCR_CPU_WFI_DECREASE_EN    (BIT(9))
#define PCR_CPU_WFI_DECREASE_EN_M  (PCR_CPU_WFI_DECREASE_EN_V << PCR_CPU_WFI_DECREASE_EN_S)
#define PCR_CPU_WFI_DECREASE_EN_V  0x00000001U
#define PCR_CPU_WFI_DECREASE_EN_S  9

/** PCR_CPU_FREQ_CONF_REG register
 *  CPU_FREQ configuration register
 */
#define PCR_CPU_FREQ_CONF_REG (DR_REG_PCR_BASE + 0x11c)
/** PCR_CPU_DIV_NUM : R/W; bitpos: [7:0]; default: 0;
 *  Set this field to generate clk_cpu derived by clk_hproot. The clk_cpu is
 *  div1(default)/div2/div4 of clk_hproot. This field is only available for low-speed
 *  clock-source such as XTAL/FOSC, and should be used together with PCR_AHB_DIV_NUM.
 */
#define PCR_CPU_DIV_NUM    0x000000FFU
#define PCR_CPU_DIV_NUM_M  (PCR_CPU_DIV_NUM_V << PCR_CPU_DIV_NUM_S)
#define PCR_CPU_DIV_NUM_V  0x000000FFU
#define PCR_CPU_DIV_NUM_S  0

/** PCR_AHB_FREQ_CONF_REG register
 *  AHB_FREQ configuration register
 */
#define PCR_AHB_FREQ_CONF_REG (DR_REG_PCR_BASE + 0x120)
/** PCR_AHB_DIV_NUM : R/W; bitpos: [7:0]; default: 0;
 *  Set this field to generate clk_ahb derived by clk_hproot. The clk_ahb is
 *  div1(default)/div2/div4/div8 of clk_hproot. This field is only available for
 *  low-speed clock-source such as XTAL/FOSC, and should be used together with
 *  PCR_CPU_DIV_NUM.
 */
#define PCR_AHB_DIV_NUM    0x000000FFU
#define PCR_AHB_DIV_NUM_M  (PCR_AHB_DIV_NUM_V << PCR_AHB_DIV_NUM_S)
#define PCR_AHB_DIV_NUM_V  0x000000FFU
#define PCR_AHB_DIV_NUM_S  0

/** PCR_APB_FREQ_CONF_REG register
 *  APB_FREQ configuration register
 */
#define PCR_APB_FREQ_CONF_REG (DR_REG_PCR_BASE + 0x124)
/** PCR_APB_DECREASE_DIV_NUM : R/W; bitpos: [7:0]; default: 0;
 *  If this field's value is grater than PCR_APB_DIV_NUM, the clk_apb will be
 *  automatically down to clk_apb_decrease only when no access is on apb-bus, and will
 *  recover to the previous frequency when a new access appears on apb-bus. Set as one
 *  within (0,1,3) to set clk_apb_decrease as div1/div2/div4(default) of clk_ahb. Note
 *  that enable this function will reduce performance. Users can set this field as zero
 *  to disable the auto-decrease-apb-freq function. By default, this function is
 *  disable.
 */
#define PCR_APB_DECREASE_DIV_NUM    0x000000FFU
#define PCR_APB_DECREASE_DIV_NUM_M  (PCR_APB_DECREASE_DIV_NUM_V << PCR_APB_DECREASE_DIV_NUM_S)
#define PCR_APB_DECREASE_DIV_NUM_V  0x000000FFU
#define PCR_APB_DECREASE_DIV_NUM_S  0
/** PCR_APB_DIV_NUM : R/W; bitpos: [15:8]; default: 0;
 *  Set as one within (0,1,3) to generate clk_apb derived by clk_ahb. The clk_apb is
 *  div1(default)/div2/div4 of clk_ahb.
 */
#define PCR_APB_DIV_NUM    0x000000FFU
#define PCR_APB_DIV_NUM_M  (PCR_APB_DIV_NUM_V << PCR_APB_DIV_NUM_S)
#define PCR_APB_DIV_NUM_V  0x000000FFU
#define PCR_APB_DIV_NUM_S  8

