espressif/esp-idf/components/soc/esp32h4/register/soc/pcr_reg.h
/** PCR_SYSCLK_FREQ_QUERY_0_REG register
 *  SYSCLK frequency query 0 register
 */
#define PCR_SYSCLK_FREQ_QUERY_0_REG (DR_REG_PCR_BASE + 0x128)
/** PCR_FOSC_FREQ : HRO; bitpos: [7:0]; default: 8;
 *  This field indicates the frequency(MHz) of FOSC.
 */
#define PCR_FOSC_FREQ    0x000000FFU
#define PCR_FOSC_FREQ_M  (PCR_FOSC_FREQ_V << PCR_FOSC_FREQ_S)
#define PCR_FOSC_FREQ_V  0x000000FFU
#define PCR_FOSC_FREQ_S  0
/** PCR_PLL_FREQ : HRO; bitpos: [17:8]; default: 96;
 *  This field indicates the frequency(MHz) of SPLL.
 */
#define PCR_PLL_FREQ    0x000003FFU
#define PCR_PLL_FREQ_M  (PCR_PLL_FREQ_V << PCR_PLL_FREQ_S)
#define PCR_PLL_FREQ_V  0x000003FFU
#define PCR_PLL_FREQ_S  8

/** PCR_PLL_DIV_CLK_EN_REG register
 *  SPLL DIV clock-gating configuration register
 */
#define PCR_PLL_DIV_CLK_EN_REG (DR_REG_PCR_BASE + 0x12c)
/** PCR_PLL_96M_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  This field is used to open 96 MHz clock  derived from SPLL 96M. 0: close, 1:
 *  open(default). Only available when high-speed clock-source SPLL is active.
 */
#define PCR_PLL_96M_CLK_EN    (BIT(0))
#define PCR_PLL_96M_CLK_EN_M  (PCR_PLL_96M_CLK_EN_V << PCR_PLL_96M_CLK_EN_S)
#define PCR_PLL_96M_CLK_EN_V  0x00000001U
#define PCR_PLL_96M_CLK_EN_S  0
/** PCR_PLL_64M_CLK_EN : R/W; bitpos: [1]; default: 1;
 *  This field is used to open 64 MHz clock derived from SPLL 64M. 0: close, 1:
 *  open(default). Only available when high-speed clock-source SPLL is active.
 */
#define PCR_PLL_64M_CLK_EN    (BIT(1))
#define PCR_PLL_64M_CLK_EN_M  (PCR_PLL_64M_CLK_EN_V << PCR_PLL_64M_CLK_EN_S)
#define PCR_PLL_64M_CLK_EN_V  0x00000001U
#define PCR_PLL_64M_CLK_EN_S  1
/** PCR_PLL_48M_CLK_EN : R/W; bitpos: [2]; default: 1;
 *  This field is used to open 48 MHz clock (div2 of SPLL) derived from SPLL 96M. 0:
 *  close, 1: open(default). Only available when high-speed clock-source SPLL is active.
 */
#define PCR_PLL_48M_CLK_EN    (BIT(2))
#define PCR_PLL_48M_CLK_EN_M  (PCR_PLL_48M_CLK_EN_V << PCR_PLL_48M_CLK_EN_S)
#define PCR_PLL_48M_CLK_EN_V  0x00000001U
#define PCR_PLL_48M_CLK_EN_S  2
/** PCR_PLL_32M_CLK_EN : R/W; bitpos: [3]; default: 1;
 *  This field is used to open 32 MHz clock (div2  of SPLL) derived from SPLL 64M. 0:
 *  close, 1: open(default). Only available when high-speed clock-source SPLL is active.
 */
#define PCR_PLL_32M_CLK_EN    (BIT(3))
#define PCR_PLL_32M_CLK_EN_M  (PCR_PLL_32M_CLK_EN_V << PCR_PLL_32M_CLK_EN_S)
#define PCR_PLL_32M_CLK_EN_V  0x00000001U
#define PCR_PLL_32M_CLK_EN_S  3
/** PCR_PLL_16M_CLK_EN : R/W; bitpos: [4]; default: 1;
 *  This field is used to open 16 MHz clock (div6 of SPLL) derived from SPLL 96M. 0:
 *  close, 1: open(default). Only available when high-speed clock-source SPLL is active.
 */
#define PCR_PLL_16M_CLK_EN    (BIT(4))
#define PCR_PLL_16M_CLK_EN_M  (PCR_PLL_16M_CLK_EN_V << PCR_PLL_16M_CLK_EN_S)
#define PCR_PLL_16M_CLK_EN_V  0x00000001U
#define PCR_PLL_16M_CLK_EN_S  4
/** PCR_PLL_8M_CLK_EN : R/W; bitpos: [5]; default: 1;
 *  This field is used to open   8 MHz clock (div12 of SPLL) derived from SPLL 96M. 0:
 *  close, 1: open(default). Only available when high-speed clock-source SPLL is active.
 */
#define PCR_PLL_8M_CLK_EN    (BIT(5))
#define PCR_PLL_8M_CLK_EN_M  (PCR_PLL_8M_CLK_EN_V << PCR_PLL_8M_CLK_EN_S)
#define PCR_PLL_8M_CLK_EN_V  0x00000001U
#define PCR_PLL_8M_CLK_EN_S  5

/** PCR_CTRL_CLK_OUT_EN_REG register
 *  CLK_OUT_EN configuration register
 */
#define PCR_CTRL_CLK_OUT_EN_REG (DR_REG_PCR_BASE + 0x130)
/** PCR_CLK8_OEN : R/W; bitpos: [0]; default: 1;
 *  Set 1 to enable 8m clock
 */
#define PCR_CLK8_OEN    (BIT(0))
#define PCR_CLK8_OEN_M  (PCR_CLK8_OEN_V << PCR_CLK8_OEN_S)
#define PCR_CLK8_OEN_V  0x00000001U
#define PCR_CLK8_OEN_S  0
/** PCR_CLK16_OEN : R/W; bitpos: [1]; default: 1;
 *  Set 1 to enable 16m clock
 */
#define PCR_CLK16_OEN    (BIT(1))
#define PCR_CLK16_OEN_M  (PCR_CLK16_OEN_V << PCR_CLK16_OEN_S)
#define PCR_CLK16_OEN_V  0x00000001U
#define PCR_CLK16_OEN_S  1
/** PCR_CLK32_OEN : R/W; bitpos: [2]; default: 1;
 *  Set 1 to enable 32m clock
 */
#define PCR_CLK32_OEN    (BIT(2))
#define PCR_CLK32_OEN_M  (PCR_CLK32_OEN_V << PCR_CLK32_OEN_S)
#define PCR_CLK32_OEN_V  0x00000001U
#define PCR_CLK32_OEN_S  2
/** PCR_CLK_ADC_INF_OEN : R/W; bitpos: [3]; default: 1;
 *  Reserved
 */
#define PCR_CLK_ADC_INF_OEN    (BIT(3))
#define PCR_CLK_ADC_INF_OEN_M  (PCR_CLK_ADC_INF_OEN_V << PCR_CLK_ADC_INF_OEN_S)
#define PCR_CLK_ADC_INF_OEN_V  0x00000001U
#define PCR_CLK_ADC_INF_OEN_S  3
/** PCR_CLK_DFM_INF_OEN : R/W; bitpos: [4]; default: 1;
 *  Reserved
 */
#define PCR_CLK_DFM_INF_OEN    (BIT(4))
#define PCR_CLK_DFM_INF_OEN_M  (PCR_CLK_DFM_INF_OEN_V << PCR_CLK_DFM_INF_OEN_S)
#define PCR_CLK_DFM_INF_OEN_V  0x00000001U
#define PCR_CLK_DFM_INF_OEN_S  4
/** PCR_CLK_SDM_MOD_OEN : R/W; bitpos: [5]; default: 1;
 *  Reserved
 */
#define PCR_CLK_SDM_MOD_OEN    (BIT(5))
#define PCR_CLK_SDM_MOD_OEN_M  (PCR_CLK_SDM_MOD_OEN_V << PCR_CLK_SDM_MOD_OEN_S)
#define PCR_CLK_SDM_MOD_OEN_V  0x00000001U
#define PCR_CLK_SDM_MOD_OEN_S  5
/** PCR_CLK_XTAL_OEN : R/W; bitpos: [6]; default: 1;
 *  Set 1 to enable xtal clock
 */
#define PCR_CLK_XTAL_OEN    (BIT(6))
#define PCR_CLK_XTAL_OEN_M  (PCR_CLK_XTAL_OEN_V << PCR_CLK_XTAL_OEN_S)
#define PCR_CLK_XTAL_OEN_V  0x00000001U
#define PCR_CLK_XTAL_OEN_S  6

/** PCR_TIMG_CALI_CLK_CONF_REG register
 *  timergrout calibrate clock configuration register
 */
#define PCR_TIMG_CALI_CLK_CONF_REG (DR_REG_PCR_BASE + 0x134)
/** PCR_TIMG_CALI_CLK_SEL : R/W; bitpos: [2:0]; default: 0;
 *  Configures the 32KHz clock for TIMER_GROUP.
 *  0 (default): RC32K_CLK
 *  1: XTAL32K_CLK
 *  2: OSC_SLOW_CLK
 *  3: RC_SLOW_CLK
 *  4: TIMG_SECURE_CLK
 */
#define PCR_TIMG_CALI_CLK_SEL    0x00000007U
#define PCR_TIMG_CALI_CLK_SEL_M  (PCR_TIMG_CALI_CLK_SEL_V << PCR_TIMG_CALI_CLK_SEL_S)
#define PCR_TIMG_CALI_CLK_SEL_V  0x00000007U
#define PCR_TIMG_CALI_CLK_SEL_S  0
/** PCR_TIMG_SECURE_CLK_SEL : R/W; bitpos: [7:4]; default: 7;
 *  Configures the clock source for the TIMG_SECURE_CLK.
 *  0: EXT_IO_CLK
 *  1: CPU_CLK
 *  2: AHB_CLK
 *  3: APB_CLK
 *  4: sec function clock
 *  5: mspi function clock
 *  6: iomux function clock
 *  7: parl io rx function clock
 *  8: parl io tx function clock
 *  9: spi3 function clock
 *  10: spi2 function clock
 *  11: RC_FAST_CLK
 */
#define PCR_TIMG_SECURE_CLK_SEL    0x0000000FU
#define PCR_TIMG_SECURE_CLK_SEL_M  (PCR_TIMG_SECURE_CLK_SEL_V << PCR_TIMG_SECURE_CLK_SEL_S)
#define PCR_TIMG_SECURE_CLK_SEL_V  0x0000000FU
#define PCR_TIMG_SECURE_CLK_SEL_S  4
/** PCR_TIMG_SECURE_CLK_DIV_NUM : R/W; bitpos: [15:8]; default: 7;
 *  When PCR_TIMG_CALI_CLK_SEL set as 4, This field PCR_TIMG_SECURE_CLK_DIV_NUM is used
 *  to set the divider number of TIMG_SECURE_CLK.
 */
#define PCR_TIMG_SECURE_CLK_DIV_NUM    0x000000FFU
#define PCR_TIMG_SECURE_CLK_DIV_NUM_M  (PCR_TIMG_SECURE_CLK_DIV_NUM_V << PCR_TIMG_SECURE_CLK_DIV_NUM_S)
#define PCR_TIMG_SECURE_CLK_DIV_NUM_V  0x000000FFU
#define PCR_TIMG_SECURE_CLK_DIV_NUM_S  8

/** PCR_ROM_MEM_LP_CTRL_REG register
 *  rom power control register
 */
#define PCR_ROM_MEM_LP_CTRL_REG (DR_REG_PCR_BASE + 0x138)
/** PCR_INTERNAL_ROM_MEM_LP_MODE : R/W; bitpos: [1:0]; default: 0;
 *  Configures rom low power mode in low power stage.
 *  0(default): deep sleep
 *  1: light sleep
 *  2: shut down
 *  3: disable low power stage
 */
#define PCR_INTERNAL_ROM_MEM_LP_MODE    0x00000003U
#define PCR_INTERNAL_ROM_MEM_LP_MODE_M  (PCR_INTERNAL_ROM_MEM_LP_MODE_V << PCR_INTERNAL_ROM_MEM_LP_MODE_S)
#define PCR_INTERNAL_ROM_MEM_LP_MODE_V  0x00000003U
#define PCR_INTERNAL_ROM_MEM_LP_MODE_S  0
/** PCR_INTERNAL_ROM_MEM_LP_EN : R/W; bitpos: [3:2]; default: 0;
 *  Set this bit to power down rom.
 */
#define PCR_INTERNAL_ROM_MEM_LP_EN    0x00000003U
#define PCR_INTERNAL_ROM_MEM_LP_EN_M  (PCR_INTERNAL_ROM_MEM_LP_EN_V << PCR_INTERNAL_ROM_MEM_LP_EN_S)
#define PCR_INTERNAL_ROM_MEM_LP_EN_V  0x00000003U
#define PCR_INTERNAL_ROM_MEM_LP_EN_S  2
/** PCR_INTERNAL_ROM_MEM_FORCE_CTRL : R/W; bitpos: [5:4]; default: 0;
 *  Set this bit to force software control rom, disable hardware control.
 */
#define PCR_INTERNAL_ROM_MEM_FORCE_CTRL    0x00000003U
#define PCR_INTERNAL_ROM_MEM_FORCE_CTRL_M  (PCR_INTERNAL_ROM_MEM_FORCE_CTRL_V << PCR_INTERNAL_ROM_MEM_FORCE_CTRL_S)
#define PCR_INTERNAL_ROM_MEM_FORCE_CTRL_V  0x00000003U
#define PCR_INTERNAL_ROM_MEM_FORCE_CTRL_S  4

/** PCR_SRAM_POWER_CONF_1_REG register
 *  HP SRAM/ROM configuration register
 */
#define PCR_SRAM_POWER_CONF_1_REG (DR_REG_PCR_BASE + 0x13c)
/** PCR_SRAM_CLKGATE_FORCE_ON : R/W; bitpos: [26:20]; default: 0;
 *  1: Force to open the clock and bypass the gate-clock when accessing the SRAM. 0: A
 *  gate-clock will be used when accessing the SRAM.
 */
#define PCR_SRAM_CLKGATE_FORCE_ON    0x0000007FU
#define PCR_SRAM_CLKGATE_FORCE_ON_M  (PCR_SRAM_CLKGATE_FORCE_ON_V << PCR_SRAM_CLKGATE_FORCE_ON_S)
#define PCR_SRAM_CLKGATE_FORCE_ON_V  0x0000007FU
#define PCR_SRAM_CLKGATE_FORCE_ON_S  20

/** PCR_SEC_CONF_REG register
 *  Clock source configuration register for External Memory Encryption and Decryption
 */
#define PCR_SEC_CONF_REG (DR_REG_PCR_BASE + 0x140)
/** PCR_SEC_CLK_SEL : R/W; bitpos: [1:0]; default: 0;
 *  Configures the clock source for the External Memory Encryption and Decryption
 *  module.
 *  0(default): XTAL_CLK
 *  1: RC_FAST_CLK
 *  2: PLL_F64M_CLK
 *  3: PLL_F96M_CLK
 */
#define PCR_SEC_CLK_SEL    0x00000003U
#define PCR_SEC_CLK_SEL_M  (PCR_SEC_CLK_SEL_V << PCR_SEC_CLK_SEL_S)
#define PCR_SEC_CLK_SEL_V  0x00000003U
#define PCR_SEC_CLK_SEL_S  0
/** PCR_SEC_RST_EN : R/W; bitpos: [2]; default: 0;
 *  Set 1 to reset sec module
 */
#define PCR_SEC_RST_EN    (BIT(2))
#define PCR_SEC_RST_EN_M  (PCR_SEC_RST_EN_V << PCR_SEC_RST_EN_S)
#define PCR_SEC_RST_EN_V  0x00000001U
#define PCR_SEC_RST_EN_S  2
/** PCR_SEC_DIV_NUMINATOR : R/W; bitpos: [6:3]; default: 0;
 *  The  denominator of the frequency divider factor of the sec function clock.
 */
#define PCR_SEC_DIV_NUMINATOR    0x0000000FU
#define PCR_SEC_DIV_NUMINATOR_M  (PCR_SEC_DIV_NUMINATOR_V << PCR_SEC_DIV_NUMINATOR_S)
#define PCR_SEC_DIV_NUMINATOR_V  0x0000000FU
#define PCR_SEC_DIV_NUMINATOR_S  3
/** PCR_SEC_DIV_DENOMINATOR : R/W; bitpos: [10:7]; default: 0;
 *  The numerator of the frequency divider factor of the sec function clock.
 */
#define PCR_SEC_DIV_DENOMINATOR    0x0000000FU
#define PCR_SEC_DIV_DENOMINATOR_M  (PCR_SEC_DIV_DENOMINATOR_V << PCR_SEC_DIV_DENOMINATOR_S)
#define PCR_SEC_DIV_DENOMINATOR_V  0x0000000FU
#define PCR_SEC_DIV_DENOMINATOR_S  7
/** PCR_SEC_DIV_NUM : R/W; bitpos: [14:11]; default: 0;
 *  The integral part of the frequency divider factor of the sec function clock.
 */
#define PCR_SEC_DIV_NUM    0x0000000FU
#define PCR_SEC_DIV_NUM_M  (PCR_SEC_DIV_NUM_V << PCR_SEC_DIV_NUM_S)
#define PCR_SEC_DIV_NUM_V  0x0000000FU
#define PCR_SEC_DIV_NUM_S  11

/** PCR_BUS_CLK_UPDATE_REG register
 *  Configuration register for applying updated high-performance system clock sources
 */
#define PCR_BUS_CLK_UPDATE_REG (DR_REG_PCR_BASE + 0x148)
/** PCR_BUS_CLOCK_UPDATE : R/W/WTC; bitpos: [0]; default: 0;
 *  Configures whether or not to update configurations for CPU_CLK division, AHB_CLK
 *  division and HP_ROOT_CLK clock source selection.
 *  0: Not update configurations
 *  1: Update configurations
 *  This bit is automatically cleared when configurations have been updated.
 */
#define PCR_BUS_CLOCK_UPDATE    (BIT(0))
#define PCR_BUS_CLOCK_UPDATE_M  (PCR_BUS_CLOCK_UPDATE_V << PCR_BUS_CLOCK_UPDATE_S)
#define PCR_BUS_CLOCK_UPDATE_V  0x00000001U
#define PCR_BUS_CLOCK_UPDATE_S  0

