espressif/esp-idf/components/soc/esp32h4/register/soc/pcr_reg.h
/** PCR_SAR_CLK_DIV_REG register
 *  SAR ADC clock divisor configuration register
 */
#define PCR_SAR_CLK_DIV_REG (DR_REG_PCR_BASE + 0x14c)
/** PCR_SAR2_CLK_DIV_NUM : R/W; bitpos: [7:0]; default: 15;
 *  Configures the divisor for SAR ADC 2  clock to generate ADC analog control signals.
 */
#define PCR_SAR2_CLK_DIV_NUM    0x000000FFU
#define PCR_SAR2_CLK_DIV_NUM_M  (PCR_SAR2_CLK_DIV_NUM_V << PCR_SAR2_CLK_DIV_NUM_S)
#define PCR_SAR2_CLK_DIV_NUM_V  0x000000FFU
#define PCR_SAR2_CLK_DIV_NUM_S  0
/** PCR_SAR1_CLK_DIV_NUM : R/W; bitpos: [15:8]; default: 15;
 *  Configures the divisor for SAR ADC 1  clock to generate ADC analog control signals.
 */
#define PCR_SAR1_CLK_DIV_NUM    0x000000FFU
#define PCR_SAR1_CLK_DIV_NUM_M  (PCR_SAR1_CLK_DIV_NUM_V << PCR_SAR1_CLK_DIV_NUM_S)
#define PCR_SAR1_CLK_DIV_NUM_V  0x000000FFU
#define PCR_SAR1_CLK_DIV_NUM_S  8

/** PCR_PWDET_SAR_CLK_CONF_REG register
 *  xxxx
 */
#define PCR_PWDET_SAR_CLK_CONF_REG (DR_REG_PCR_BASE + 0x150)
/** PCR_PWDET_SAR_READER_EN : R/W; bitpos: [8]; default: 1;
 *  xxxx
 */
#define PCR_PWDET_SAR_READER_EN    (BIT(8))
#define PCR_PWDET_SAR_READER_EN_M  (PCR_PWDET_SAR_READER_EN_V << PCR_PWDET_SAR_READER_EN_S)
#define PCR_PWDET_SAR_READER_EN_V  0x00000001U
#define PCR_PWDET_SAR_READER_EN_S  8

/** PCR_TIMERGROUP_WDT_CONF_REG register
 *  TIMERGROUP_WDT configuration register
 */
#define PCR_TIMERGROUP_WDT_CONF_REG (DR_REG_PCR_BASE + 0x154)
/** PCR_TG0_WDT_RST_EN : R/W; bitpos: [0]; default: 0;
 *  Set 1 to reset timer_group0 wdt module
 */
#define PCR_TG0_WDT_RST_EN    (BIT(0))
#define PCR_TG0_WDT_RST_EN_M  (PCR_TG0_WDT_RST_EN_V << PCR_TG0_WDT_RST_EN_S)
#define PCR_TG0_WDT_RST_EN_V  0x00000001U
#define PCR_TG0_WDT_RST_EN_S  0
/** PCR_TG1_WDT_RST_EN : R/W; bitpos: [1]; default: 0;
 *  Set 1 to reset timer_group1 wdt module
 */
#define PCR_TG1_WDT_RST_EN    (BIT(1))
#define PCR_TG1_WDT_RST_EN_M  (PCR_TG1_WDT_RST_EN_V << PCR_TG1_WDT_RST_EN_S)
#define PCR_TG1_WDT_RST_EN_V  0x00000001U
#define PCR_TG1_WDT_RST_EN_S  1

/** PCR_TIMERGROUP_XTAL_CONF_REG register
 *  TIMERGROUP1 configuration register
 */
#define PCR_TIMERGROUP_XTAL_CONF_REG (DR_REG_PCR_BASE + 0x160)
/** PCR_TG0_XTAL_RST_EN : R/W; bitpos: [0]; default: 0;
 *  Set 1 to reset timer_group0 xtal clock domain
 */
#define PCR_TG0_XTAL_RST_EN    (BIT(0))
#define PCR_TG0_XTAL_RST_EN_M  (PCR_TG0_XTAL_RST_EN_V << PCR_TG0_XTAL_RST_EN_S)
#define PCR_TG0_XTAL_RST_EN_V  0x00000001U
#define PCR_TG0_XTAL_RST_EN_S  0
/** PCR_TG1_XTAL_RST_EN : R/W; bitpos: [1]; default: 0;
 *  Set 1 to reset timer_group1 xtal clock domain
 */
#define PCR_TG1_XTAL_RST_EN    (BIT(1))
#define PCR_TG1_XTAL_RST_EN_M  (PCR_TG1_XTAL_RST_EN_V << PCR_TG1_XTAL_RST_EN_S)
#define PCR_TG1_XTAL_RST_EN_V  0x00000001U
#define PCR_TG1_XTAL_RST_EN_S  1
/** PCR_TG0_XTAL_CLK_EN : R/W; bitpos: [2]; default: 1;
 *  Set 1 to enable tg0 xtal clock
 */
#define PCR_TG0_XTAL_CLK_EN    (BIT(2))
#define PCR_TG0_XTAL_CLK_EN_M  (PCR_TG0_XTAL_CLK_EN_V << PCR_TG0_XTAL_CLK_EN_S)
#define PCR_TG0_XTAL_CLK_EN_V  0x00000001U
#define PCR_TG0_XTAL_CLK_EN_S  2

/** PCR_KM_CONF_REG register
 *  Key Manager configuration register
 */
#define PCR_KM_CONF_REG (DR_REG_PCR_BASE + 0x164)
/** PCR_KM_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  Set 1 to enable km clock
 */
#define PCR_KM_CLK_EN    (BIT(0))
#define PCR_KM_CLK_EN_M  (PCR_KM_CLK_EN_V << PCR_KM_CLK_EN_S)
#define PCR_KM_CLK_EN_V  0x00000001U
#define PCR_KM_CLK_EN_S  0
/** PCR_KM_RST_EN : R/W; bitpos: [1]; default: 0;
 *  Set 1 to reset km module
 */
#define PCR_KM_RST_EN    (BIT(1))
#define PCR_KM_RST_EN_M  (PCR_KM_RST_EN_V << PCR_KM_RST_EN_S)
#define PCR_KM_RST_EN_V  0x00000001U
#define PCR_KM_RST_EN_S  1
/** PCR_KM_READY : RO; bitpos: [2]; default: 1;
 *  Query this field after reset km module
 */
#define PCR_KM_READY    (BIT(2))
#define PCR_KM_READY_M  (PCR_KM_READY_V << PCR_KM_READY_S)
#define PCR_KM_READY_V  0x00000001U
#define PCR_KM_READY_S  2

/** PCR_KM_MEM_LP_CTRL_REG register
 *  KM memory power control register
 */
#define PCR_KM_MEM_LP_CTRL_REG (DR_REG_PCR_BASE + 0x168)
/** PCR_KM_MEM_LP_MODE : R/W; bitpos: [1:0]; default: 2;
 *  Configures km memory low power mode in low power stage.
 *  0: deep sleep
 *  1: light sleep
 *  2(default): shut down
 *  3: disable low power stage
 */
#define PCR_KM_MEM_LP_MODE    0x00000003U
#define PCR_KM_MEM_LP_MODE_M  (PCR_KM_MEM_LP_MODE_V << PCR_KM_MEM_LP_MODE_S)
#define PCR_KM_MEM_LP_MODE_V  0x00000003U
#define PCR_KM_MEM_LP_MODE_S  0
/** PCR_KM_MEM_LP_EN : R/W; bitpos: [2]; default: 1;
 *  Set this bit to power down km memory.
 */
#define PCR_KM_MEM_LP_EN    (BIT(2))
#define PCR_KM_MEM_LP_EN_M  (PCR_KM_MEM_LP_EN_V << PCR_KM_MEM_LP_EN_S)
#define PCR_KM_MEM_LP_EN_V  0x00000001U
#define PCR_KM_MEM_LP_EN_S  2
/** PCR_KM_MEM_FORCE_CTRL : R/W; bitpos: [3]; default: 0;
 *  Set this bit to force software control km memory, disable hardware control.
 */
#define PCR_KM_MEM_FORCE_CTRL    (BIT(3))
#define PCR_KM_MEM_FORCE_CTRL_M  (PCR_KM_MEM_FORCE_CTRL_V << PCR_KM_MEM_FORCE_CTRL_S)
#define PCR_KM_MEM_FORCE_CTRL_V  0x00000001U
#define PCR_KM_MEM_FORCE_CTRL_S  3

/** PCR_TCM_MEM_MONITOR_CONF_REG register
 *  TCM_MEM_MONITOR configuration register
 */
#define PCR_TCM_MEM_MONITOR_CONF_REG (DR_REG_PCR_BASE + 0x16c)
/** PCR_TCM_MEM_MONITOR_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  Set 1 to enable tcm_mem_monitor clock
 */
#define PCR_TCM_MEM_MONITOR_CLK_EN    (BIT(0))
#define PCR_TCM_MEM_MONITOR_CLK_EN_M  (PCR_TCM_MEM_MONITOR_CLK_EN_V << PCR_TCM_MEM_MONITOR_CLK_EN_S)
#define PCR_TCM_MEM_MONITOR_CLK_EN_V  0x00000001U
#define PCR_TCM_MEM_MONITOR_CLK_EN_S  0
/** PCR_TCM_MEM_MONITOR_RST_EN : R/W; bitpos: [1]; default: 1;
 *  Set 1 to reset tcm_mem_monitor module
 */
#define PCR_TCM_MEM_MONITOR_RST_EN    (BIT(1))
#define PCR_TCM_MEM_MONITOR_RST_EN_M  (PCR_TCM_MEM_MONITOR_RST_EN_V << PCR_TCM_MEM_MONITOR_RST_EN_S)
#define PCR_TCM_MEM_MONITOR_RST_EN_V  0x00000001U
#define PCR_TCM_MEM_MONITOR_RST_EN_S  1
/** PCR_TCM_MEM_MONITOR_READY : RO; bitpos: [2]; default: 1;
 *  Query this field after reset tcm_mem_monitor module
 */
#define PCR_TCM_MEM_MONITOR_READY    (BIT(2))
#define PCR_TCM_MEM_MONITOR_READY_M  (PCR_TCM_MEM_MONITOR_READY_V << PCR_TCM_MEM_MONITOR_READY_S)
#define PCR_TCM_MEM_MONITOR_READY_V  0x00000001U
#define PCR_TCM_MEM_MONITOR_READY_S  2

/** PCR_PSRAM_MEM_MONITOR_CONF_REG register
 *  PSRAM_MEM_MONITOR configuration register
 */
#define PCR_PSRAM_MEM_MONITOR_CONF_REG (DR_REG_PCR_BASE + 0x170)
/** PCR_PSRAM_MEM_MONITOR_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  Set 1 to enable psram_mem_monitor clock
 */
#define PCR_PSRAM_MEM_MONITOR_CLK_EN    (BIT(0))
#define PCR_PSRAM_MEM_MONITOR_CLK_EN_M  (PCR_PSRAM_MEM_MONITOR_CLK_EN_V << PCR_PSRAM_MEM_MONITOR_CLK_EN_S)
#define PCR_PSRAM_MEM_MONITOR_CLK_EN_V  0x00000001U
#define PCR_PSRAM_MEM_MONITOR_CLK_EN_S  0
/** PCR_PSRAM_MEM_MONITOR_RST_EN : R/W; bitpos: [1]; default: 1;
 *  Set 1 to reset psram_mem_monitor module
 */
#define PCR_PSRAM_MEM_MONITOR_RST_EN    (BIT(1))
#define PCR_PSRAM_MEM_MONITOR_RST_EN_M  (PCR_PSRAM_MEM_MONITOR_RST_EN_V << PCR_PSRAM_MEM_MONITOR_RST_EN_S)
#define PCR_PSRAM_MEM_MONITOR_RST_EN_V  0x00000001U
#define PCR_PSRAM_MEM_MONITOR_RST_EN_S  1
/** PCR_PSRAM_MEM_MONITOR_READY : RO; bitpos: [2]; default: 1;
 *  Query this field after reset psram_mem_monitor module
 */
#define PCR_PSRAM_MEM_MONITOR_READY    (BIT(2))
#define PCR_PSRAM_MEM_MONITOR_READY_M  (PCR_PSRAM_MEM_MONITOR_READY_V << PCR_PSRAM_MEM_MONITOR_READY_S)
#define PCR_PSRAM_MEM_MONITOR_READY_V  0x00000001U
#define PCR_PSRAM_MEM_MONITOR_READY_S  2

/** PCR_RESET_EVENT_BYPASS_REG register
 *  reset event bypass backdoor configuration register
 */
#define PCR_RESET_EVENT_BYPASS_REG (DR_REG_PCR_BASE + 0x174)
/** PCR_RESET_EVENT_BYPASS_TEE_APM : R/W; bitpos: [0]; default: 0;
 *  This field is used to control reset event relationship for tee_apm. 1: tee_apm will
 *  only be reset by power-reset. some reset event will be bypass. 0:tee_apm will not
 *  only be reset by power-reset, but also some reset event.
 */
#define PCR_RESET_EVENT_BYPASS_TEE_APM    (BIT(0))
#define PCR_RESET_EVENT_BYPASS_TEE_APM_M  (PCR_RESET_EVENT_BYPASS_TEE_APM_V << PCR_RESET_EVENT_BYPASS_TEE_APM_S)
#define PCR_RESET_EVENT_BYPASS_TEE_APM_V  0x00000001U
#define PCR_RESET_EVENT_BYPASS_TEE_APM_S  0
/** PCR_RESET_EVENT_BYPASS_PCR : R/W; bitpos: [1]; default: 0;
 *  This field is used to control reset event relationship for pcr. 1: pcr will only be
 *  reset by power-reset. some reset event will be bypass. 0:pcr will not only be reset
 *  by power-reset, but also some reset event.
 */
#define PCR_RESET_EVENT_BYPASS_PCR    (BIT(1))
#define PCR_RESET_EVENT_BYPASS_PCR_M  (PCR_RESET_EVENT_BYPASS_PCR_V << PCR_RESET_EVENT_BYPASS_PCR_S)
#define PCR_RESET_EVENT_BYPASS_PCR_V  0x00000001U
#define PCR_RESET_EVENT_BYPASS_PCR_S  1
/** PCR_RESET_EVENT_BYPASS_HPSYSREG : R/W; bitpos: [2]; default: 0;
 *  This field is used to control reset event relationship for hpsysreg. 1: hpsysreg
 *  will only be reset by power-reset. some reset event will be bypass. 0:hpsysreg will
 *  not only be reset by power-reset, but also some reset event.
 */
#define PCR_RESET_EVENT_BYPASS_HPSYSREG    (BIT(2))
#define PCR_RESET_EVENT_BYPASS_HPSYSREG_M  (PCR_RESET_EVENT_BYPASS_HPSYSREG_V << PCR_RESET_EVENT_BYPASS_HPSYSREG_S)
#define PCR_RESET_EVENT_BYPASS_HPSYSREG_V  0x00000001U
#define PCR_RESET_EVENT_BYPASS_HPSYSREG_S  2
/** PCR_RESET_EVENT_BYPASS_IOMUX : R/W; bitpos: [3]; default: 0;
 *  This field is used to control reset event relationship for iomux. 1: iomux will
 *  only be reset by power-reset. some reset event will be bypass. 0:iomux will not
 *  only be reset by power-reset, but also some reset event.
 */
#define PCR_RESET_EVENT_BYPASS_IOMUX    (BIT(3))
#define PCR_RESET_EVENT_BYPASS_IOMUX_M  (PCR_RESET_EVENT_BYPASS_IOMUX_V << PCR_RESET_EVENT_BYPASS_IOMUX_S)
#define PCR_RESET_EVENT_BYPASS_IOMUX_V  0x00000001U
#define PCR_RESET_EVENT_BYPASS_IOMUX_S  3
/** PCR_RESET_EVENT_BYPASS_INTMTX0 : R/W; bitpos: [4]; default: 0;
 *  This field is used to control reset event relationship for intmtx0. 1: intmtx0 will
 *  only be reset by power-reset. some reset event will be bypass. 0:intmtx0 will not
 *  only be reset by power-reset, but also some reset event.
 */
#define PCR_RESET_EVENT_BYPASS_INTMTX0    (BIT(4))
#define PCR_RESET_EVENT_BYPASS_INTMTX0_M  (PCR_RESET_EVENT_BYPASS_INTMTX0_V << PCR_RESET_EVENT_BYPASS_INTMTX0_S)
#define PCR_RESET_EVENT_BYPASS_INTMTX0_V  0x00000001U
#define PCR_RESET_EVENT_BYPASS_INTMTX0_S  4
/** PCR_RESET_EVENT_BYPASS_INTMTX1 : R/W; bitpos: [5]; default: 0;
 *  This field is used to control reset event relationship for intmtx1. 1: intmtx1 will
 *  only be reset by power-reset. some reset event will be bypass. 0:intmtx1 will not
 *  only be reset by power-reset, but also some reset event.
 */
#define PCR_RESET_EVENT_BYPASS_INTMTX1    (BIT(5))
#define PCR_RESET_EVENT_BYPASS_INTMTX1_M  (PCR_RESET_EVENT_BYPASS_INTMTX1_V << PCR_RESET_EVENT_BYPASS_INTMTX1_S)
#define PCR_RESET_EVENT_BYPASS_INTMTX1_V  0x00000001U
#define PCR_RESET_EVENT_BYPASS_INTMTX1_S  5
/** PCR_RESET_EVENT_BYPASS_MODEM : R/W; bitpos: [6]; default: 0;
 *  This field is used to control reset event relationship for modem. 1: modem will
 *  only be reset by power-reset. some reset event will be bypass. 0:modem will not
 *  only be reset by power-reset, but also some reset event.
 */
#define PCR_RESET_EVENT_BYPASS_MODEM    (BIT(6))
#define PCR_RESET_EVENT_BYPASS_MODEM_M  (PCR_RESET_EVENT_BYPASS_MODEM_V << PCR_RESET_EVENT_BYPASS_MODEM_S)
#define PCR_RESET_EVENT_BYPASS_MODEM_V  0x00000001U
#define PCR_RESET_EVENT_BYPASS_MODEM_S  6
/** PCR_RESET_EVENT_BYPASS_BUS_MODEM : R/W; bitpos: [7]; default: 0;
 *  This field is used to control reset event relationship for bus_modem. 1: bus_modem
 *  will only be reset by power-reset. some reset event will be bypass. 0:bus_modem
 *  will not only be reset by power-reset, but also some reset event.
 */
#define PCR_RESET_EVENT_BYPASS_BUS_MODEM    (BIT(7))
#define PCR_RESET_EVENT_BYPASS_BUS_MODEM_M  (PCR_RESET_EVENT_BYPASS_BUS_MODEM_V << PCR_RESET_EVENT_BYPASS_BUS_MODEM_S)
#define PCR_RESET_EVENT_BYPASS_BUS_MODEM_V  0x00000001U
#define PCR_RESET_EVENT_BYPASS_BUS_MODEM_S  7

/** PCR_HPCORE_MEM_LP_CTRL_REG register
 *  HP CORE0 & HP CORE1 memory power control register
 */
#define PCR_HPCORE_MEM_LP_CTRL_REG (DR_REG_PCR_BASE + 0x178)
/** PCR_HPCORE_MEM_LP_MODE : R/W; bitpos: [1:0]; default: 0;
 *  Configures memory low power mode in low power stage.
 *  0(default): deep sleep
 *  1: light sleep
 *  2: shut down
 *  3: disable low power stage
 */
#define PCR_HPCORE_MEM_LP_MODE    0x00000003U
#define PCR_HPCORE_MEM_LP_MODE_M  (PCR_HPCORE_MEM_LP_MODE_V << PCR_HPCORE_MEM_LP_MODE_S)
#define PCR_HPCORE_MEM_LP_MODE_V  0x00000003U
#define PCR_HPCORE_MEM_LP_MODE_S  0
/** PCR_HPCORE_MEM_LP_EN : R/W; bitpos: [2]; default: 0;
 *  Set this bit to power down HP CORE0 & HP CORE1 memory.
 */
#define PCR_HPCORE_MEM_LP_EN    (BIT(2))
#define PCR_HPCORE_MEM_LP_EN_M  (PCR_HPCORE_MEM_LP_EN_V << PCR_HPCORE_MEM_LP_EN_S)
#define PCR_HPCORE_MEM_LP_EN_V  0x00000001U
#define PCR_HPCORE_MEM_LP_EN_S  2
/** PCR_HPCORE_MEM_FORCE_CTRL : R/W; bitpos: [3]; default: 0;
 *  Set this bit to force software control HP CORE0 & HP CORE1 memory, disable hardware
 *  control.
 */
#define PCR_HPCORE_MEM_FORCE_CTRL    (BIT(3))
#define PCR_HPCORE_MEM_FORCE_CTRL_M  (PCR_HPCORE_MEM_FORCE_CTRL_V << PCR_HPCORE_MEM_FORCE_CTRL_S)
#define PCR_HPCORE_MEM_FORCE_CTRL_V  0x00000001U
#define PCR_HPCORE_MEM_FORCE_CTRL_S  3

/** PCR_USB_OTG11_CONF_REG register
 *  USB_OTG configuration register
 */
#define PCR_USB_OTG11_CONF_REG (DR_REG_PCR_BASE + 0x17c)
/** PCR_USB_OTG11_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  Set 1 to enable usb_otg11 clock
 */
#define PCR_USB_OTG11_CLK_EN    (BIT(0))
#define PCR_USB_OTG11_CLK_EN_M  (PCR_USB_OTG11_CLK_EN_V << PCR_USB_OTG11_CLK_EN_S)
#define PCR_USB_OTG11_CLK_EN_V  0x00000001U
#define PCR_USB_OTG11_CLK_EN_S  0
/** PCR_USB_OTG11_RST_EN : R/W; bitpos: [1]; default: 0;
 *  Set 1 to reset usb_otg11 module
 */
#define PCR_USB_OTG11_RST_EN    (BIT(1))
#define PCR_USB_OTG11_RST_EN_M  (PCR_USB_OTG11_RST_EN_V << PCR_USB_OTG11_RST_EN_S)
#define PCR_USB_OTG11_RST_EN_V  0x00000001U
#define PCR_USB_OTG11_RST_EN_S  1
/** PCR_USB_OTG11_READY : RO; bitpos: [2]; default: 1;
 *  Query this field after reset usb_otg11 module
 */
#define PCR_USB_OTG11_READY    (BIT(2))
#define PCR_USB_OTG11_READY_M  (PCR_USB_OTG11_READY_V << PCR_USB_OTG11_READY_S)
#define PCR_USB_OTG11_READY_V  0x00000001U
#define PCR_USB_OTG11_READY_S  2

/** PCR_USB_OTG11_MEM_LP_CTRL_REG register
 *  USB_OTG11 memory power control register
 */
#define PCR_USB_OTG11_MEM_LP_CTRL_REG (DR_REG_PCR_BASE + 0x180)
/** PCR_USB_OTG11_MEM_LP_MODE : R/W; bitpos: [1:0]; default: 0;
 *  Configures usb_otg11 memory low power mode in low power stage.
 *  0(default): deep sleep
 *  1: light sleep
 *  2: shut down
 *  3: disable low power stage
 */
#define PCR_USB_OTG11_MEM_LP_MODE    0x00000003U
#define PCR_USB_OTG11_MEM_LP_MODE_M  (PCR_USB_OTG11_MEM_LP_MODE_V << PCR_USB_OTG11_MEM_LP_MODE_S)
#define PCR_USB_OTG11_MEM_LP_MODE_V  0x00000003U
#define PCR_USB_OTG11_MEM_LP_MODE_S  0
/** PCR_USB_OTG11_MEM_LP_EN : R/W; bitpos: [2]; default: 0;
 *  Set this bit to power down usb_otg11 memory.
 */
#define PCR_USB_OTG11_MEM_LP_EN    (BIT(2))
#define PCR_USB_OTG11_MEM_LP_EN_M  (PCR_USB_OTG11_MEM_LP_EN_V << PCR_USB_OTG11_MEM_LP_EN_S)
#define PCR_USB_OTG11_MEM_LP_EN_V  0x00000001U
#define PCR_USB_OTG11_MEM_LP_EN_S  2
/** PCR_USB_OTG11_MEM_FORCE_CTRL : R/W; bitpos: [3]; default: 0;
 *  Set this bit to force software control usb_otg11 memory, disable hardware control.
 */
#define PCR_USB_OTG11_MEM_FORCE_CTRL    (BIT(3))
#define PCR_USB_OTG11_MEM_FORCE_CTRL_M  (PCR_USB_OTG11_MEM_FORCE_CTRL_V << PCR_USB_OTG11_MEM_FORCE_CTRL_S)
#define PCR_USB_OTG11_MEM_FORCE_CTRL_V  0x00000001U
#define PCR_USB_OTG11_MEM_FORCE_CTRL_S  3

/** PCR_CORE1_CONF_REG register
 *  USB_OTG configuration register
 */
#define PCR_CORE1_CONF_REG (DR_REG_PCR_BASE + 0x188)
/** PCR_CORE1_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  Set 1 to enable core1 clock
 */
#define PCR_CORE1_CLK_EN    (BIT(0))
#define PCR_CORE1_CLK_EN_M  (PCR_CORE1_CLK_EN_V << PCR_CORE1_CLK_EN_S)
#define PCR_CORE1_CLK_EN_V  0x00000001U
#define PCR_CORE1_CLK_EN_S  0
/** PCR_CORE1_RST_EN : R/W; bitpos: [1]; default: 1;
 *  Set 1 to reset core1 module
 */
#define PCR_CORE1_RST_EN    (BIT(1))
#define PCR_CORE1_RST_EN_M  (PCR_CORE1_RST_EN_V << PCR_CORE1_RST_EN_S)
#define PCR_CORE1_RST_EN_V  0x00000001U
#define PCR_CORE1_RST_EN_S  1

/** PCR_I2C1_CONF_REG register
 *  I2C configuration register
 */
#define PCR_I2C1_CONF_REG (DR_REG_PCR_BASE + 0x18c)
/** PCR_I2C1_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  Set 1 to enable i2c1 apb clock
 */
#define PCR_I2C1_CLK_EN    (BIT(0))
#define PCR_I2C1_CLK_EN_M  (PCR_I2C1_CLK_EN_V << PCR_I2C1_CLK_EN_S)
#define PCR_I2C1_CLK_EN_V  0x00000001U
#define PCR_I2C1_CLK_EN_S  0
/** PCR_I2C1_RST_EN : R/W; bitpos: [1]; default: 0;
 *  Set 1 to reset i2c1 module
 */
#define PCR_I2C1_RST_EN    (BIT(1))
#define PCR_I2C1_RST_EN_M  (PCR_I2C1_RST_EN_V << PCR_I2C1_RST_EN_S)
#define PCR_I2C1_RST_EN_V  0x00000001U
#define PCR_I2C1_RST_EN_S  1

/** PCR_I2C1_SCLK_CONF_REG register
 *  I2C_SCLK configuration register
 */
#define PCR_I2C1_SCLK_CONF_REG (DR_REG_PCR_BASE + 0x190)
/** PCR_I2C1_SCLK_DIV_A : R/W; bitpos: [5:0]; default: 0;
 *  The  denominator of the frequency divider factor of the i2c1 function clock.
 */
#define PCR_I2C1_SCLK_DIV_A    0x0000003FU
#define PCR_I2C1_SCLK_DIV_A_M  (PCR_I2C1_SCLK_DIV_A_V << PCR_I2C1_SCLK_DIV_A_S)
#define PCR_I2C1_SCLK_DIV_A_V  0x0000003FU
#define PCR_I2C1_SCLK_DIV_A_S  0
/** PCR_I2C1_SCLK_DIV_B : R/W; bitpos: [11:6]; default: 0;
 *  The numerator of the frequency divider factor of the i2c1 function clock.
 */
#define PCR_I2C1_SCLK_DIV_B    0x0000003FU
#define PCR_I2C1_SCLK_DIV_B_M  (PCR_I2C1_SCLK_DIV_B_V << PCR_I2C1_SCLK_DIV_B_S)
#define PCR_I2C1_SCLK_DIV_B_V  0x0000003FU
#define PCR_I2C1_SCLK_DIV_B_S  6
/** PCR_I2C1_SCLK_DIV_NUM : R/W; bitpos: [19:12]; default: 0;
 *  The integral part of the frequency divider factor of the i2c1 function clock.
 */
#define PCR_I2C1_SCLK_DIV_NUM    0x000000FFU
#define PCR_I2C1_SCLK_DIV_NUM_M  (PCR_I2C1_SCLK_DIV_NUM_V << PCR_I2C1_SCLK_DIV_NUM_S)
#define PCR_I2C1_SCLK_DIV_NUM_V  0x000000FFU
#define PCR_I2C1_SCLK_DIV_NUM_S  12
/** PCR_I2C1_SCLK_SEL : R/W; bitpos: [20]; default: 0;
 *  Configures the clock source of I2C.
 *  0 (default): XTAL_CLK
 *  1: RC_FAST_CLK
 */
#define PCR_I2C1_SCLK_SEL    (BIT(20))
#define PCR_I2C1_SCLK_SEL_M  (PCR_I2C1_SCLK_SEL_V << PCR_I2C1_SCLK_SEL_S)
#define PCR_I2C1_SCLK_SEL_V  0x00000001U
#define PCR_I2C1_SCLK_SEL_S  20
/** PCR_I2C1_SCLK_EN : R/W; bitpos: [22]; default: 0;
 *  Set 1 to enable i2c function clock
 */
#define PCR_I2C1_SCLK_EN    (BIT(22))
#define PCR_I2C1_SCLK_EN_M  (PCR_I2C1_SCLK_EN_V << PCR_I2C1_SCLK_EN_S)
#define PCR_I2C1_SCLK_EN_V  0x00000001U
#define PCR_I2C1_SCLK_EN_S  22

/** PCR_PWM1_CONF_REG register
 *  PWM1 configuration register
 */
#define PCR_PWM1_CONF_REG (DR_REG_PCR_BASE + 0x194)
/** PCR_PWM1_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  Set 1 to enable pwm1 clock
 */
#define PCR_PWM1_CLK_EN    (BIT(0))
#define PCR_PWM1_CLK_EN_M  (PCR_PWM1_CLK_EN_V << PCR_PWM1_CLK_EN_S)
#define PCR_PWM1_CLK_EN_V  0x00000001U
#define PCR_PWM1_CLK_EN_S  0
/** PCR_PWM1_RST_EN : R/W; bitpos: [1]; default: 0;
 *  Set 1 to reset pwm1 module
 */
#define PCR_PWM1_RST_EN    (BIT(1))
#define PCR_PWM1_RST_EN_M  (PCR_PWM1_RST_EN_V << PCR_PWM1_RST_EN_S)
#define PCR_PWM1_RST_EN_V  0x00000001U
#define PCR_PWM1_RST_EN_S  1
/** PCR_PWM1_READY : RO; bitpos: [2]; default: 1;
 *  Query this field after reset pwm1 module
 */
#define PCR_PWM1_READY    (BIT(2))
#define PCR_PWM1_READY_M  (PCR_PWM1_READY_V << PCR_PWM1_READY_S)
#define PCR_PWM1_READY_V  0x00000001U
#define PCR_PWM1_READY_S  2

/** PCR_PWM1_CLK_CONF_REG register
 *  PWM1_CLK configuration register
 */
#define PCR_PWM1_CLK_CONF_REG (DR_REG_PCR_BASE + 0x198)
/** PCR_PWM1_DIV_NUM : R/W; bitpos: [19:12]; default: 4;
 *  The integral part of the frequency divider factor of the pwm1 function clock.
 */
#define PCR_PWM1_DIV_NUM    0x000000FFU
#define PCR_PWM1_DIV_NUM_M  (PCR_PWM1_DIV_NUM_V << PCR_PWM1_DIV_NUM_S)
#define PCR_PWM1_DIV_NUM_V  0x000000FFU
#define PCR_PWM1_DIV_NUM_S  12
/** PCR_PWM1_CLKM_SEL : R/W; bitpos: [21:20]; default: 0;
 *  Configures the clock source of MCPWM1.
 *  0 (default): XTAL_CLK
 *  1: RC_FAST_CLK
 *  2: PLL_F160M_CLK
 */
#define PCR_PWM1_CLKM_SEL    0x00000003U
#define PCR_PWM1_CLKM_SEL_M  (PCR_PWM1_CLKM_SEL_V << PCR_PWM1_CLKM_SEL_S)
#define PCR_PWM1_CLKM_SEL_V  0x00000003U
#define PCR_PWM1_CLKM_SEL_S  20
/** PCR_PWM1_CLKM_EN : R/W; bitpos: [22]; default: 0;
 *  set this field as 1 to activate pwm1 clkm.
 */
#define PCR_PWM1_CLKM_EN    (BIT(22))
#define PCR_PWM1_CLKM_EN_M  (PCR_PWM1_CLKM_EN_V << PCR_PWM1_CLKM_EN_S)
#define PCR_PWM1_CLKM_EN_V  0x00000001U
#define PCR_PWM1_CLKM_EN_S  22

/** PCR_SPI3_CONF_REG register
 *  SPI3 configuration register
 */
#define PCR_SPI3_CONF_REG (DR_REG_PCR_BASE + 0x19c)
/** PCR_SPI3_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  Set 1 to enable spi3 apb clock
 */
#define PCR_SPI3_CLK_EN    (BIT(0))
#define PCR_SPI3_CLK_EN_M  (PCR_SPI3_CLK_EN_V << PCR_SPI3_CLK_EN_S)
#define PCR_SPI3_CLK_EN_V  0x00000001U
#define PCR_SPI3_CLK_EN_S  0
/** PCR_SPI3_RST_EN : R/W; bitpos: [1]; default: 1;
 *  Set 1 to reset spi3 module
 */
#define PCR_SPI3_RST_EN    (BIT(1))
#define PCR_SPI3_RST_EN_M  (PCR_SPI3_RST_EN_V << PCR_SPI3_RST_EN_S)
#define PCR_SPI3_RST_EN_V  0x00000001U
#define PCR_SPI3_RST_EN_S  1
/** PCR_SPI3_READY : RO; bitpos: [2]; default: 1;
 *  Query this field after reset spi3 module
 */
#define PCR_SPI3_READY    (BIT(2))
#define PCR_SPI3_READY_M  (PCR_SPI3_READY_V << PCR_SPI3_READY_S)
#define PCR_SPI3_READY_V  0x00000001U
#define PCR_SPI3_READY_S  2

/** PCR_SPI3_CLKM_CONF_REG register
 *  SPI3_CLKM configuration register
 */
#define PCR_SPI3_CLKM_CONF_REG (DR_REG_PCR_BASE + 0x1a0)
/** PCR_SPI3_CLKM_DIV_NUM : R/W; bitpos: [19:12]; default: 0;
 *  The integral part of the frequency divider factor of the spi3_mst clock.
 */
#define PCR_SPI3_CLKM_DIV_NUM    0x000000FFU
#define PCR_SPI3_CLKM_DIV_NUM_M  (PCR_SPI3_CLKM_DIV_NUM_V << PCR_SPI3_CLKM_DIV_NUM_S)
#define PCR_SPI3_CLKM_DIV_NUM_V  0x000000FFU
#define PCR_SPI3_CLKM_DIV_NUM_S  12
/** PCR_SPI3_CLKM_SEL : R/W; bitpos: [21:20]; default: 0;
 *  Configures the clock source of SPI3.
 *  0 (default): XTAL_CLK
 *  1: PLL_F48M_CLK
 *  2: RC_FAST_CLK
 */
#define PCR_SPI3_CLKM_SEL    0x00000003U
#define PCR_SPI3_CLKM_SEL_M  (PCR_SPI3_CLKM_SEL_V << PCR_SPI3_CLKM_SEL_S)
#define PCR_SPI3_CLKM_SEL_V  0x00000003U
#define PCR_SPI3_CLKM_SEL_S  20
/** PCR_SPI3_CLKM_EN : R/W; bitpos: [22]; default: 0;
 *  Set 1 to enable spi3 function clock
 */
#define PCR_SPI3_CLKM_EN    (BIT(22))
#define PCR_SPI3_CLKM_EN_M  (PCR_SPI3_CLKM_EN_V << PCR_SPI3_CLKM_EN_S)
#define PCR_SPI3_CLKM_EN_V  0x00000001U
#define PCR_SPI3_CLKM_EN_S  22

