espressif/esp-idf/components/soc/esp32h4/register/soc/pcr_reg.h
/** PCR_ASRC_FUNC_CLK_CONF_REG register
 *  AUDIO_SAMPLE_RATE_FUNC_CLK configuration register
 */
#define PCR_ASRC_FUNC_CLK_CONF_REG (DR_REG_PCR_BASE + 0x1a8)
/** PCR_ASRC_APB_CLK_EN : R/W; bitpos: [22]; default: 1;
 *  Set 1 to enable audio_sample rate converter apb clock
 */
#define PCR_ASRC_APB_CLK_EN    (BIT(22))
#define PCR_ASRC_APB_CLK_EN_M  (PCR_ASRC_APB_CLK_EN_V << PCR_ASRC_APB_CLK_EN_S)
#define PCR_ASRC_APB_CLK_EN_V  0x00000001U
#define PCR_ASRC_APB_CLK_EN_S  22
/** PCR_ASRC_FUNC_CLK_EN : R/W; bitpos: [23]; default: 1;
 *  Set 1 to enable audio_sample rate converter function clock
 */
#define PCR_ASRC_FUNC_CLK_EN    (BIT(23))
#define PCR_ASRC_FUNC_CLK_EN_M  (PCR_ASRC_FUNC_CLK_EN_V << PCR_ASRC_FUNC_CLK_EN_S)
#define PCR_ASRC_FUNC_CLK_EN_V  0x00000001U
#define PCR_ASRC_FUNC_CLK_EN_S  23
/** PCR_ASRC_RST_EN : R/W; bitpos: [24]; default: 0;
 *  Set 1 to reset audio_sample_rate_converter module
 */
#define PCR_ASRC_RST_EN    (BIT(24))
#define PCR_ASRC_RST_EN_M  (PCR_ASRC_RST_EN_V << PCR_ASRC_RST_EN_S)
#define PCR_ASRC_RST_EN_V  0x00000001U
#define PCR_ASRC_RST_EN_S  24

/** PCR_BUS_CLOCK_GATE_BYPASS_REG register
 *  bus clock gating bypass configuration register
 */
#define PCR_BUS_CLOCK_GATE_BYPASS_REG (DR_REG_PCR_BASE + 0x1ac)
/** PCR_AHB_CLK_GATING_BYPASS : R/W; bitpos: [0]; default: 1;
 *  Set 1 to bypass the clock gating for ahb bus
 */
#define PCR_AHB_CLK_GATING_BYPASS    (BIT(0))
#define PCR_AHB_CLK_GATING_BYPASS_M  (PCR_AHB_CLK_GATING_BYPASS_V << PCR_AHB_CLK_GATING_BYPASS_S)
#define PCR_AHB_CLK_GATING_BYPASS_V  0x00000001U
#define PCR_AHB_CLK_GATING_BYPASS_S  0
/** PCR_APB_CLK_GATING_BYPASS : R/W; bitpos: [1]; default: 1;
 *  Set 1 to bypass the clock gating for apb bus
 */
#define PCR_APB_CLK_GATING_BYPASS    (BIT(1))
#define PCR_APB_CLK_GATING_BYPASS_M  (PCR_APB_CLK_GATING_BYPASS_V << PCR_APB_CLK_GATING_BYPASS_S)
#define PCR_APB_CLK_GATING_BYPASS_V  0x00000001U
#define PCR_APB_CLK_GATING_BYPASS_S  1
/** PCR_AXI_CLK_GATING_BYPASS : R/W; bitpos: [2]; default: 1;
 *  Set 1 to bypass the clock gating for axi bus
 */
#define PCR_AXI_CLK_GATING_BYPASS    (BIT(2))
#define PCR_AXI_CLK_GATING_BYPASS_M  (PCR_AXI_CLK_GATING_BYPASS_V << PCR_AXI_CLK_GATING_BYPASS_S)
#define PCR_AXI_CLK_GATING_BYPASS_V  0x00000001U
#define PCR_AXI_CLK_GATING_BYPASS_S  2
/** PCR_MEM_CLK_GATING_BYPASS : R/W; bitpos: [3]; default: 1;
 *  Set 1 to bypass the clock gating for mem bus
 */
#define PCR_MEM_CLK_GATING_BYPASS    (BIT(3))
#define PCR_MEM_CLK_GATING_BYPASS_M  (PCR_MEM_CLK_GATING_BYPASS_V << PCR_MEM_CLK_GATING_BYPASS_S)
#define PCR_MEM_CLK_GATING_BYPASS_V  0x00000001U
#define PCR_MEM_CLK_GATING_BYPASS_S  3

/** PCR_ZERO_DET_CONF_REG register
 *  ZERO_DET configuration register
 */
#define PCR_ZERO_DET_CONF_REG (DR_REG_PCR_BASE + 0x1b0)
/** PCR_ZERO_DET_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  Set 1 to enable zero_det apb clock
 */
#define PCR_ZERO_DET_CLK_EN    (BIT(0))
#define PCR_ZERO_DET_CLK_EN_M  (PCR_ZERO_DET_CLK_EN_V << PCR_ZERO_DET_CLK_EN_S)
#define PCR_ZERO_DET_CLK_EN_V  0x00000001U
#define PCR_ZERO_DET_CLK_EN_S  0
/** PCR_ZERO_DET_RST_EN : R/W; bitpos: [1]; default: 1;
 *  Set 1 to reset zero_det module
 */
#define PCR_ZERO_DET_RST_EN    (BIT(1))
#define PCR_ZERO_DET_RST_EN_M  (PCR_ZERO_DET_RST_EN_V << PCR_ZERO_DET_RST_EN_S)
#define PCR_ZERO_DET_RST_EN_V  0x00000001U
#define PCR_ZERO_DET_RST_EN_S  1

/** PCR_ZERO_DET_CLK_CONF_REG register
 *  ZERO_DET_CLK configuration register
 */
#define PCR_ZERO_DET_CLK_CONF_REG (DR_REG_PCR_BASE + 0x1b4)
/** PCR_ZERO_DET_FUNC_CLK_SEL : R/W; bitpos: [21:20]; default: 0;
 *  Configures the clock source of ZERO DETECT.
 *  0 (default): XTAL_CLK
 *  1: RC_FAST_CLK
 *  2: PLL_F80M_CLK
 */
#define PCR_ZERO_DET_FUNC_CLK_SEL    0x00000003U
#define PCR_ZERO_DET_FUNC_CLK_SEL_M  (PCR_ZERO_DET_FUNC_CLK_SEL_V << PCR_ZERO_DET_FUNC_CLK_SEL_S)
#define PCR_ZERO_DET_FUNC_CLK_SEL_V  0x00000003U
#define PCR_ZERO_DET_FUNC_CLK_SEL_S  20
/** PCR_ZERO_DET_FUNC_CLK_EN : R/W; bitpos: [22]; default: 0;
 *  Set 1 to enable zero_det function clock
 */
#define PCR_ZERO_DET_FUNC_CLK_EN    (BIT(22))
#define PCR_ZERO_DET_FUNC_CLK_EN_M  (PCR_ZERO_DET_FUNC_CLK_EN_V << PCR_ZERO_DET_FUNC_CLK_EN_S)
#define PCR_ZERO_DET_FUNC_CLK_EN_V  0x00000001U
#define PCR_ZERO_DET_FUNC_CLK_EN_S  22

/** PCR_RST_EN_REG register
 *  PCR clock gating configure register
 */
#define PCR_RST_EN_REG (DR_REG_PCR_BASE + 0x1b8)
/** PCR_PCR_RST_EN : R/W; bitpos: [0]; default: 0;
 *  Set 1 to reset pcr module
 */
#define PCR_PCR_RST_EN    (BIT(0))
#define PCR_PCR_RST_EN_M  (PCR_PCR_RST_EN_V << PCR_PCR_RST_EN_S)
#define PCR_PCR_RST_EN_V  0x00000001U
#define PCR_PCR_RST_EN_S  0

/** PCR_DATE_REG register
 *  Date register.
 */
#define PCR_DATE_REG (DR_REG_PCR_BASE + 0xffc)
/** PCR_DATE : R/W; bitpos: [27:0]; default: 37823024;
 *  PCR version information.
 */
#define PCR_DATE    0x0FFFFFFFU
#define PCR_DATE_M  (PCR_DATE_V << PCR_DATE_S)
#define PCR_DATE_V  0x0FFFFFFFU
#define PCR_DATE_S  0

#ifdef __cplusplus
}
#endif
